[
  {
    "cve": "CVE-2016-0215",
    "year": "2016",
    "description": "IBM DB2 9.7, 10.1 before FP6, and 10.5 before FP8 on AIX, Linux, HP, Solaris and Windows allow remote authenticated users to cause a denial of service (daemon crash) via a SELECT statement with a subquery containing the AVG OLAP function on an Oracle compatible database.",
    "severity": "MEDIUM",
    "url": "http://www-01.ibm.com/support/docview.wss?uid=swg21979986"
  },
  {
    "cve": "CVE-2016-0275",
    "year": "2016",
    "description": "IBM Financial Transaction Manager (FTM) for ACH Services for Multi-Platform 2.1.1.2 and 3.0.0.x before fp0013, Financial Transaction Manager (FTM) for Check Services for Multi-Platform 2.1.1.2 and 3.0.0.x before fp0013, and Financial Transaction Manager (FTM) for Corporate Payment Services (CPS) for Multi-Platform 2.1.1.2 and 3.0.0.x before fp0013 allows local users to obtain sensitive information via vectors related to cacheable HTTPS responses.",
    "severity": "LOW",
    "url": "http://www-01.ibm.com/support/docview.wss?uid=swg21977245"
  },
  {
    "cve": "CVE-2016-0708",
    "year": "2016",
    "description": "Applications deployed to Cloud Foundry, versions v166 through v227, may be vulnerable to a remote disclosure of information, including, but not limited to environment variables and bound service details. For applications to be vulnerable, they must have been staged using automatic buildpack detection, passed through the Java Buildpack detection script, and allow the serving of static content from within the deployed artifact. The default Apache Tomcat configuration in the affected java buildpack versions for some basic web application archive (WAR) packaged applications are vulnerable to this issue.",
    "severity": "MEDIUM",
    "url": "https://www.cloudfoundry.org/blog/cve-2016-0708/"
  },
  {
    "cve": "CVE-2016-0715",
    "year": "2016",
    "description": "Pivotal Cloud Foundry Elastic Runtime version 1.4.0 through 1.4.5, 1.5.0 through 1.5.11 and 1.6.0 through 1.6.11 is vulnerable to a remote information disclosure. It was found that original mitigation configuration instructions provided as part of CVE-2016-0708 were incomplete and could leave PHP Buildpack, Staticfile Buildpack and potentially other custom Buildpack applications vulnerable to remote information disclosure. Affected applications use automated buildpack detection, serve files directly from the root of the application and have a buildpack that matched after the Java Buildpack in the system buildpack priority when Java Buildpack versions 2.0 through 3.4 were present.",
    "severity": "MEDIUM",
    "url": "https://pivotal.io/security/cve-2016-0715"
  },
  {
    "cve": "CVE-2016-0796",
    "year": "2016",
    "description": "WordPress Plugin mb.miniAudioPlayer-an HTML5 audio player for your mp3 files is prone to multiple vulnerabilities, including open proxy and security bypass vulnerabilities because it fails to properly verify user-supplied input. An attacker may leverage these issues to hide attacks directed at a target site from behind vulnerable website or to perform otherwise restricted actions and subsequently download files with the extension mp3, mp4a, wav and ogg from anywhere the web server application has read access to the system. WordPress Plugin mb.miniAudioPlayer-an HTML5 audio player for your mp3 files version 1.7.6 is vulnerable; prior versions may also be affected.",
    "severity": "HIGH",
    "url": "http://www.vapidlabs.com/advisory.php?v=162"
  },
  {
    "cve": "CVE-2016-0898",
    "year": "2016",
    "description": "MySQL for PCF tiles 1.7.x before 1.7.10 were discovered to log the AWS access key in plaintext. These credentials were logged to the Service Backup component logs, and not the system log, thus were not exposed outside the Service Backup VM.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/95146"
  },
  {
    "cve": "CVE-2016-1000028",
    "year": "2016",
    "description": "Tenable Nessus before 6.8 has a stored XSS issue that requires admin-level authentication to the Nessus UI, and would only potentially impact other admins. (Tenable ID 5198).",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/92134"
  },
  {
    "cve": "CVE-2016-1000029",
    "year": "2016",
    "description": "Tenable Nessus before 6.8 has a stored XSS issue that requires admin-level authentication to the Nessus UI, and would potentially impact other admins (Tenable IDs 5218 and 5269).",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/92134"
  },
  {
    "cve": "CVE-2016-1000030",
    "year": "2016",
    "description": "Pidgin version <2.11.0 contains a vulnerability in X.509 Certificates imports specifically due to improper check of return values from gnutls_x509_crt_init() and gnutls_x509_crt_import() that can result in code execution. This attack appear to be exploitable via custom X.509 certificate from another client. This vulnerability appears to have been fixed in 2.11.0.",
    "severity": "CRITICAL",
    "url": "https://access.redhat.com/security/cve/cve-2016-1000030"
  },
  {
    "cve": "CVE-2016-1000037",
    "year": "2016",
    "description": "Pagure: XSS possible in file attachment endpoint",
    "severity": "MEDIUM",
    "url": "https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2016-1000037"
  },
  {
    "cve": "CVE-2016-1000107",
    "year": "2016",
    "description": "inets in Erlang possibly 22.1 and earlier follows RFC 3875 section 4.1.18 and therefore does not protect applications from the presence of untrusted client data in the HTTP_PROXY environment variable, which might allow remote attackers to redirect an application's outbound HTTP traffic to an arbitrary proxy server via a crafted Proxy header in an HTTP request, aka an \"httpoxy\" issue.",
    "severity": "MEDIUM",
    "url": "http://www.openwall.com/lists/oss-security/2016/07/18/6"
  },
  {
    "cve": "CVE-2016-1000108",
    "year": "2016",
    "description": "yaws before 2.0.4 does not attempt to address RFC 3875 section 4.1.18 namespace conflicts and therefore does not protect CGI applications from the presence of untrusted client data in the HTTP_PROXY environment variable, which might allow remote attackers to redirect a CGI application's outbound HTTP traffic to an arbitrary proxy server via a crafted Proxy header in an HTTP request, aka an \"httpoxy\" issue.",
    "severity": "MEDIUM",
    "url": "http://www.openwall.com/lists/oss-security/2016/07/18/6"
  },
  {
    "cve": "CVE-2016-1000109",
    "year": "2016",
    "description": "HHVM does not attempt to address RFC 3875 section 4.1.18 namespace conflicts and therefore does not protect CGI applications from the presence of untrusted client data in the HTTP_PROXY environment variable, which might allow remote attackers to redirect a CGI application's outbound HTTP traffic to an arbitrary proxy server via a crafted Proxy header in an HTTP request, aka an \"httpoxy\" issue. This issue affects HHVM versions prior to 3.9.6, all versions between 3.10.0 and 3.12.4 (inclusive), and all versions between 3.13.0 and 3.14.2 (inclusive).",
    "severity": "MEDIUM",
    "url": "https://github.com/facebook/hhvm/commit/423b4b719afd5ef4e6e19d8447fbf7b6bc0d0a25"
  },
  {
    "cve": "CVE-2016-1000110",
    "year": "2016",
    "description": "The CGIHandler class in Python before 2.7.12 does not protect against the HTTP_PROXY variable name clash in a CGI script, which could allow a remote attacker to redirect HTTP requests.",
    "severity": "MEDIUM",
    "url": "http://lists.opensuse.org/opensuse-security-announce/2020-01/msg00040.html"
  },
  {
    "cve": "CVE-2016-1000111",
    "year": "2016",
    "description": "Twisted before 16.3.1 does not attempt to address RFC 3875 section 4.1.18 namespace conflicts and therefore does not protect CGI applications from the presence of untrusted client data in the HTTP_PROXY environment variable, which might allow remote attackers to redirect a CGI application's outbound HTTP traffic to an arbitrary proxy server via a crafted Proxy header in an HTTP request, aka an \"httpoxy\" issue.",
    "severity": "MEDIUM",
    "url": "http://www.oracle.com/technetwork/topics/security/linuxbulletinoct2016-3090545.html"
  },
  {
    "cve": "CVE-2016-1000232",
    "year": "2016",
    "description": "NodeJS Tough-Cookie version 2.2.2 contains a Regular Expression Parsing vulnerability in HTTP request Cookie Header parsing that can result in Denial of Service. This attack appear to be exploitable via Custom HTTP header passed by client. This vulnerability appears to have been fixed in 2.3.0.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHSA-2016:2101"
  },
  {
    "cve": "CVE-2016-1000271",
    "year": "2016",
    "description": "Joomla extension DT Register version before 3.1.12 (Joomla 3.x) / 2.8.18 (Joomla 2.5) contains an SQL injection in \"/index.php?controller=calendar&format=raw&cat[0]=SQLi&task=events\". This attack appears to be exploitable if the attacker can reach the web server.",
    "severity": "CRITICAL",
    "url": "https://packetstormsecurity.com/files/140141/Joomla-DT-Register-SQL-Injection.html"
  },
  {
    "cve": "CVE-2016-1000282",
    "year": "2016",
    "description": "Haraka version 2.8.8 and earlier comes with a plugin for processing attachments for zip files. Versions 2.8.8 and earlier can be vulnerable to command injection.",
    "severity": "CRITICAL",
    "url": "https://github.com/outflanknl/Exploits/blob/master/harakiri-CVE-2016-1000282.py"
  },
  {
    "cve": "CVE-2016-1000338",
    "year": "2016",
    "description": "In Bouncy Castle JCE Provider version 1.55 and earlier the DSA does not fully validate ASN.1 encoding of signature on verification. It is possible to inject extra elements in the sequence making up the signature and still have it validate, which in some cases may allow the introduction of 'invisible' data into a signed structure.",
    "severity": "HIGH",
    "url": "https://access.redhat.com/errata/RHSA-2018:2669"
  },
  {
    "cve": "CVE-2016-1000339",
    "year": "2016",
    "description": "In the Bouncy Castle JCE Provider version 1.55 and earlier the primary engine class used for AES was AESFastEngine. Due to the highly table driven approach used in the algorithm it turns out that if the data channel on the CPU can be monitored the lookup table accesses are sufficient to leak information on the AES key being used. There was also a leak in AESEngine although it was substantially less. AESEngine has been modified to remove any signs of leakage (testing carried out on Intel X86-64) and is now the primary AES class for the BC JCE provider from 1.56. Use of AESFastEngine is now only recommended where otherwise deemed appropriate.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHSA-2018:2669"
  },
  {
    "cve": "CVE-2016-1000341",
    "year": "2016",
    "description": "In the Bouncy Castle JCE Provider version 1.55 and earlier DSA signature generation is vulnerable to timing attack. Where timings can be closely observed for the generation of signatures, the lack of blinding in 1.55, or earlier, may allow an attacker to gain information about the signature's k value and ultimately the private value as well.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHSA-2018:2669"
  },
  {
    "cve": "CVE-2016-1000342",
    "year": "2016",
    "description": "In the Bouncy Castle JCE Provider version 1.55 and earlier ECDSA does not fully validate ASN.1 encoding of signature on verification. It is possible to inject extra elements in the sequence making up the signature and still have it validate, which in some cases may allow the introduction of 'invisible' data into a signed structure.",
    "severity": "HIGH",
    "url": "https://access.redhat.com/errata/RHSA-2018:2669"
  },
  {
    "cve": "CVE-2016-1000345",
    "year": "2016",
    "description": "In the Bouncy Castle JCE Provider version 1.55 and earlier the DHIES/ECIES CBC mode vulnerable to padding oracle attack. For BC 1.55 and older, in an environment where timings can be easily observed, it is possible with enough observations to identify when the decryption is failing due to padding.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHSA-2018:2669"
  },
  {
    "cve": "CVE-2016-10256",
    "year": "2016",
    "description": "The Symantec ProxySG 6.5 (prior to 6.5.10.6), 6.6, and 6.7 (prior to 6.7.2.1) management console is susceptible to a reflected XSS vulnerability. A remote attacker can use a crafted management console URL in a phishing attack to inject arbitrary JavaScript code into the management console web client application. This is a separate vulnerability from CVE-2016-10257.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/102451"
  },
  {
    "cve": "CVE-2016-10257",
    "year": "2016",
    "description": "The Symantec Advanced Secure Gateway (ASG) 6.6, ASG 6.7 (prior to 6.7.2.1), ProxySG 6.5 (prior to 6.5.10.6), ProxySG 6.6, and ProxySG 6.7 (prior to 6.7.2.1) management console is susceptible to a reflected XSS vulnerability. A remote attacker can use a crafted management console URL in a phishing attack to inject arbitrary JavaScript code into the management console web client application. This is a separate vulnerability from CVE-2016-10256.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/102447"
  },
  {
    "cve": "CVE-2016-10408",
    "year": "2016",
    "description": "QSEE will randomly experience a fatal error during execution due to speculative instruction fetches from device memory. Device memory is not valid executable memory.",
    "severity": "HIGH",
    "url": "https://docs.qualcomm.com/product/publicresources/securitybulletin/may-2018-bulletin.html"
  },
  {
    "cve": "CVE-2016-10418",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Automobile, Snapdragon Mobile, and Snapdragon Wear MDM9206, MDM9650, SD 210/SD 212/SD 205, SD 425, SD 430, SD 450, SD 625, SD 650/52, SD 820, SD 820A, and SD 835, HLOS can enable PMIC debug through TCSR_QPDI_DISABLE_CFG due to improper access control.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10420",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile and Snapdragon Wear MDM9206, MDM9607, MDM9650, SD 210/SD 212/SD 205, SD 400, SD 410/12, SD 425, SD 430, SD 450, SD 600, SD 615/16/SD 415, SD 617, SD 625, SD 650/52, SD 800, SD 808, SD 810, SD 820, SD 835, and SDX20, while playing back a .flv clip which doesn't have an inbuilt seek table, a dynamic index table access is out of bounds and leads to crash.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10423",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Automobile and Snapdragon Mobile SD 425, SD 430, SD 450, SD 625, SD 650/52, SD 820, and SD 820A, when a Trusted Application has opened the SPI interface to a particular device, it is possible for another Trusted Application to read the data on this open interface due to non-exclusive access of the SPI bus.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10430",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Automobile and Snapdragon Mobile SD 425, SD 430, SD 450, SD 625, SD 650/52, SD 820, and SD 820A, when executing a TA which has been granted privileges to the CPVC MINK class it is possible for the TA to access methods exposed by the CPVC interface.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10442",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile MDM9640, SDM630, MSM8976, MSM8937, SDM845, MSM8976, and MSM8952, when running module or kernel code with improper access control allowing writing to arbitrary regions of memory, the user may utilize this vector to alter module executable code.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10443",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Automobile, Snapdragon Mobile, and Snapdragon Wear MDM9206, MDM9607, MDM9635M, MDM9640, MDM9645, MDM9650, MSM8909W, SD 210/SD 212/SD 205, SD 410/12, SD 425, SD 430, SD 450, SD 615/16/SD 415, SD 617, SD 625, SD 650/52, SD 808, SD 810, SD 820, SD 820A, SD 835, SD 845, and SD 850, packet replay may be possible.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10448",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile and Snapdragon Wear MDM9206, MDM9607, MDM9615, MDM9625, MDM9635M, MDM9640, MDM9645, MDM9650, MDM9655, MSM8909W, SD 210/SD 212/SD 205, SD 400, SD 410/12, SD 425, SD 430, SD 450, SD 615/16/SD 415, SD 617, SD 625, SD 650/52, SD 800, SD 808, SD 810, SD 820, SD 835, SD 845, SD 850, and SDX20, a simultaneous command post for addSA or updateSA on same SA leads to memory corruption. APIs addSA and updateSA APIs access the global variable ipsec_sa_list[] outside of mutex protection.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10458",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile SD 210/SD 212/SD 205, SD 410/12, SD 425, SD 427, SD 430, SD 435, SD 450, SD 615/16/SD 415, SD 617, SD 625, SD 650/52, SD 808, SD 810, SD 820, SD 835, SD 845, SDM630, SDM636, SDM660, SDX20, and Snapdragon_High_Med_2016, the 'proper' solution for this will be to ensure that any users of qsee_log in the bootchain (before Linux boots) unallocate their buffers and clear the qsee_log pointer. Until support for that is implemented in TZ and the bootloader, enable tz_log to avoid potential scribbling. This solution will prevent the linux kernel memory corruption.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10471",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Automobile and Snapdragon Mobile SD 425, SD 430, SD 450, SD 625, SD 650/52, SD 820, and SD 820A, an unsigned RTIC health report susceptible to tampering by malware executing in the context of the HLOS may be requested.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10479",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile MDM9607, MDM9615, MDM9635M, MDM9640, SD 210/SD 212/SD 205, SD 400, SD 600, SD 615/16/SD 415, SD 617, SD 650/52, SD 800, SD 810, and SD 820, an arbitrary length value from an incoming message to QMI Proxy can lead to an out-of-bounds write in the stack variable message.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10480",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile and Snapdragon Wear MDM9206, MDM9607, MDM9650, MSM8909W, SD 210/SD 212/SD 205, SD 400, SD 410/12, SD 425, SD 430, SD 450, SD 615/16/SD 415, SD 617, SD 625, SD 650/52, SD 800, SD 808, SD 810, SD 820, SD 835, and SDX20, possible memory corruption due to invalid integer overflow checks in exif parsing.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10498",
    "year": "2016",
    "description": "In Android before 2018-04-05 or earlier security patch level on Qualcomm Snapdragon Mobile MDM9635M, MDM9645, MDM9650, MDM9655, SD 210/SD 212/SD 205, SD 400, SD 410/12, SD 425, SD 427, SD 430, SD 435, SD 450, SD 615/16/SD 415, SD 617, SD 625, SD 650/52, SD 810, SDM630, SDM636, SDM660, and Snapdragon_High_Med_2016, stopping of the DTR prematurely causes micro kernel to be stuck. This can be triggered with a timing change injectable in RACH procedure.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/103671"
  },
  {
    "cve": "CVE-2016-10520",
    "year": "2016",
    "description": "jadedown is vulnerable to regular expression denial of service (ReDoS) when certain types of user input is passed in.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/52"
  },
  {
    "cve": "CVE-2016-10521",
    "year": "2016",
    "description": "jshamcrest is vulnerable to regular expression denial of service (ReDoS) when certain types of user input is passed in to the emailAddress validator.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/53"
  },
  {
    "cve": "CVE-2016-10522",
    "year": "2016",
    "description": "rails_admin ruby gem <v1.1.1 is vulnerable to cross-site request forgery (CSRF) attacks. Non-GET methods were not validating CSRF tokens and, as a result, an attacker could hypothetically gain access to the application administrative endpoints exposed by the gem.",
    "severity": "HIGH",
    "url": "https://github.com/sferik/rails_admin/commit/b13e879eb93b661204e9fb5e55f7afa4f397537a"
  },
  {
    "cve": "CVE-2016-10523",
    "year": "2016",
    "description": "MQTT before 3.4.6 and 4.0.x before 4.0.5 allows specifically crafted MQTT packets to crash the application, making a DoS attack feasible with very little bandwidth.",
    "severity": "HIGH",
    "url": "https://github.com/mcollina/mosca/issues/393"
  },
  {
    "cve": "CVE-2016-10524",
    "year": "2016",
    "description": "i18n-node-angular is a module used to interact between i18n and angular without using additional resources. A REST API endpoint that is used for development in i18n-node-angular before 1.4.0 was not disabled in production environments a malicious user could fill up the server causing a Denial of Service or content injection.",
    "severity": "HIGH",
    "url": "https://github.com/oliversalzburg/i18n-node-angular/commit/877720d2d9bb90dc8233706e81ffa03f99fc9dc8"
  },
  {
    "cve": "CVE-2016-10526",
    "year": "2016",
    "description": "A common setup to deploy to gh-pages on every commit via a CI system is to expose a github token to ENV and to use it directly in the auth part of the url. In module versions < 0.9.1 the auth portion of the url is outputted as part of the grunt tasks logging function. If this output is publicly available then the credentials should be considered compromised.",
    "severity": "HIGH",
    "url": "https://github.com/tschaub/grunt-gh-pages/pull/41"
  },
  {
    "cve": "CVE-2016-10527",
    "year": "2016",
    "description": "The riot-compiler version version 2.3.21 has an issue in a regex (Catastrophic Backtracking) thats make it unusable under certain conditions.",
    "severity": "HIGH",
    "url": "https://github.com/riot/compiler/issues/46"
  },
  {
    "cve": "CVE-2016-10528",
    "year": "2016",
    "description": "restafary is a REpresentful State Transfer API for Creating, Reading, Using, Deleting files on a server from the web. Restafary before 1.6.1 is able to set up a root path, which should only allow it to run inside of that root path it specified.",
    "severity": "MEDIUM",
    "url": "https://nodesecurity.io/advisories/89"
  },
  {
    "cve": "CVE-2016-10529",
    "year": "2016",
    "description": "Droppy versions <3.5.0 does not perform any verification for cross-domain websocket requests. An attacker is able to make a specially crafted page that can send requests as the context of the currently logged in user. For example this means the malicious user could add a new admin account under his control and delete others.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/91"
  },
  {
    "cve": "CVE-2016-10530",
    "year": "2016",
    "description": "The airbrake module 0.3.8 and earlier defaults to sending environment variables over HTTP. Environment variables can often times contain secret keys and other sensitive values. A malicious user could be on the same network as a regular user and intercept all the secret keys the user is sending. This goes against common best practice, which is to use HTTPS.",
    "severity": "MEDIUM",
    "url": "https://github.com/airbrake/node-airbrake/issues/70"
  },
  {
    "cve": "CVE-2016-10531",
    "year": "2016",
    "description": "marked is an application that is meant to parse and compile markdown. Due to the way that marked 0.3.5 and earlier parses input, specifically HTML entities, it's possible to bypass marked's content injection protection (`sanitize: true`) to inject a `javascript:` URL. This flaw exists because `&#xNNanything;` gets parsed to what it could and leaves the rest behind, resulting in just `anything;` being left.",
    "severity": "MEDIUM",
    "url": "https://github.com/chjj/marked/pull/592"
  },
  {
    "cve": "CVE-2016-10532",
    "year": "2016",
    "description": "console-io is a module that allows users to implement a web console in their application. A malicious user could bypass the authentication and execute any command that the user who is running the console-io application 2.2.13 and earlier is able to run. This means that if console-io was running from root, the attacker would have full access to the system. This vulnerability exists because the console-io application does not configure socket.io to require authentication, which allows a malicious user to connect via a websocket to send commands and receive the response.",
    "severity": "CRITICAL",
    "url": "https://nodesecurity.io/advisories/90"
  },
  {
    "cve": "CVE-2016-10533",
    "year": "2016",
    "description": "express-restify-mongoose is a module to easily create a flexible REST interface for mongoose models. express-restify-mongoose 2.4.2 and earlier and 3.0.X through 3.0.1 allows a malicious user to send a request for `GET /User?distinct=password` and get all the passwords for all the users in the database, despite the field being set to private. This can be used for other private data if the malicious user knew what was set as private for specific routes.",
    "severity": "HIGH",
    "url": "https://github.com/florianholzapfel/express-restify-mongoose/issues/252"
  },
  {
    "cve": "CVE-2016-10535",
    "year": "2016",
    "description": "csrf-lite is a cross-site request forgery protection library for framework-less node sites. csrf-lite uses `===`, a fail first string comparison, instead of a time constant string comparison This enables an attacker to guess the secret in no more than (16*18)288 guesses, instead of the 16^18 guesses required were the timing attack not present.",
    "severity": "MEDIUM",
    "url": "https://github.com/isaacs/csrf-lite/pull/1"
  },
  {
    "cve": "CVE-2016-10536",
    "year": "2016",
    "description": "engine.io-client is the client for engine.io, the implementation of a transport-based cross-browser/cross-device bi-directional communication layer for Socket.IO. The vulnerability is related to the way that node.js handles the `rejectUnauthorized` setting. If the value is something that evaluates to false, certificate verification will be disabled. This is problematic as engine.io-client 1.6.8 and earlier passes in an object for settings that includes the rejectUnauthorized property, whether it has been set or not. If the value has not been explicitly changed, it will be passed in as `null`, resulting in certificate verification being turned off.",
    "severity": "MEDIUM",
    "url": "https://github.com/socketio/engine.io-client/commit/2c55b278a491bf45313ecc0825cf800e2f7ff5c1"
  },
  {
    "cve": "CVE-2016-10537",
    "year": "2016",
    "description": "backbone is a module that adds in structure to a JavaScript heavy application through key-value pairs and custom events connecting to your RESTful API through JSON There exists a potential Cross Site Scripting vulnerability in the `Model#Escape` function of backbone 0.3.3 and earlier, if a user is able to supply input. This is due to the regex that's replacing things to miss the conversion of things such as `<` to `<`.",
    "severity": "MEDIUM",
    "url": "https://github.com/jashkenas/backbone/compare/0.3.3...0.5.0#diff-0d56d0d310de7ff18b3cef9c2f8f75dcL1008"
  },
  {
    "cve": "CVE-2016-10539",
    "year": "2016",
    "description": "negotiator is an HTTP content negotiator for Node.js and is used by many modules and frameworks including Express and Koa. The header for \"Accept-Language\", when parsed by negotiator 0.6.0 and earlier is vulnerable to Regular Expression Denial of Service via a specially crafted string.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/106"
  },
  {
    "cve": "CVE-2016-10540",
    "year": "2016",
    "description": "Minimatch is a minimal matching utility that works by converting glob expressions into JavaScript `RegExp` objects. The primary function, `minimatch(path, pattern)` in Minimatch 3.0.1 and earlier is vulnerable to ReDoS in the `pattern` parameter.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/118"
  },
  {
    "cve": "CVE-2016-10541",
    "year": "2016",
    "description": "The npm module \"shell-quote\" 1.6.0 and earlier cannot correctly escape \">\" and \"<\" operator used for redirection in shell. Applications that depend on shell-quote may also be vulnerable. A malicious user could perform code injection.",
    "severity": "CRITICAL",
    "url": "https://github.com/advisories/GHSA-qg8p-v9q4-gh34"
  },
  {
    "cve": "CVE-2016-10542",
    "year": "2016",
    "description": "ws is a \"simple to use, blazing fast and thoroughly tested websocket client, server and console for node.js, up-to-date against RFC-6455\". By sending an overly long websocket payload to a `ws` server, it is possible to crash the node process. This affects ws 1.1.0 and earlier.",
    "severity": "HIGH",
    "url": "https://github.com/nodejs/node/issues/7388"
  },
  {
    "cve": "CVE-2016-10544",
    "year": "2016",
    "description": "uws is a WebSocket server library. By sending a 256mb websocket message to a uws server instance with permessage-deflate enabled, there is a possibility used compression will shrink said 256mb down to less than 16mb of websocket payload which passes the length check of 16mb payload. This data will then inflate up to 256mb and crash the node process by exceeding V8's maximum string size. This affects uws >=0.10.0 <=0.10.8.",
    "severity": "MEDIUM",
    "url": "https://github.com/uWebSockets/uWebSockets/commit/37deefd01f0875e133ea967122e3a5e421b8fcd9"
  },
  {
    "cve": "CVE-2016-10547",
    "year": "2016",
    "description": "Nunjucks is a full featured templating engine for JavaScript. Versions 2.4.2 and lower have a cross site scripting (XSS) vulnerability in autoescape mode. In autoescape mode, all template vars should automatically be escaped. By using an array for the keys, such as `name[]=<script>alert(1)</script>`, it is possible to bypass autoescaping and inject content into the DOM.",
    "severity": "MEDIUM",
    "url": "https://github.com/matt-/nunjucks_test"
  },
  {
    "cve": "CVE-2016-10548",
    "year": "2016",
    "description": "Arbitrary code execution is possible in reduce-css-calc node module <=1.2.4 through crafted css. This makes cross sites scripting (XSS) possible on the client and arbitrary code injection possible on the server and user input is passed to the `calc` function.",
    "severity": "MEDIUM",
    "url": "https://gist.github.com/ChALkeR/415a41b561ebea9b341efbb40b802fc9"
  },
  {
    "cve": "CVE-2016-10549",
    "year": "2016",
    "description": "Sails is an MVC style framework for building realtime web applications. Version 0.12.7 and lower have an issue with the CORS configuration where the value of the origin header is reflected as the value for the Access-Control-Allow-Origin header. This would allow an attacker to make AJAX requests to vulnerable hosts through cross site scripting or a malicious HTML Document, effectively bypassing the Same Origin Policy. Note that this is only an issue when `allRoutes` is set to `true` and `origin` is set to `*` or left commented out in the sails CORS config file. The problem can be compounded when the cors `credentials` setting is not provided. At that point authenticated cross domain requests are possible.",
    "severity": "MEDIUM",
    "url": "http://sailsjs.org/documentation/concepts/security/cors"
  },
  {
    "cve": "CVE-2016-10550",
    "year": "2016",
    "description": "sequelize is an Object-relational mapping, or a middleman to convert things from Postgres, MySQL, MariaDB, SQLite and Microsoft SQL Server into usable data for NodeJS If user input goes into the `limit` or `order` parameters, a malicious user can put in their own SQL statements. This affects sequelize 3.16.0 and earlier.",
    "severity": "CRITICAL",
    "url": "https://github.com/sequelize/sequelize/pull/5167/commits/f282d85e60e3df5e57ecdb82adccb4eaef404f03"
  },
  {
    "cve": "CVE-2016-10553",
    "year": "2016",
    "description": "sequelize is an Object-relational mapping, or a middleman to convert things from Postgres, MySQL, MariaDB, SQLite and Microsoft SQL Server into usable data for NodeJS. A fix was pushed out that fixed potential SQL injection in sequelize 2.1.3 and earlier.",
    "severity": "CRITICAL",
    "url": "https://github.com/sequelize/sequelize/blob/master/changelog.md#300"
  },
  {
    "cve": "CVE-2016-10554",
    "year": "2016",
    "description": "sequelize is an Object-relational mapping, or a middleman to convert things from Postgres, MySQL, MariaDB, SQLite and Microsoft SQL Server into usable data for NodeJS. Before version 1.7.0-alpha3, sequelize defaulted SQLite to use MySQL backslash escaping, even though SQLite uses Postgres escaping.",
    "severity": "CRITICAL",
    "url": "https://github.com/sequelize/sequelize/commit/c876192aa6ce1f67e22b26a4d175b8478615f42d"
  },
  {
    "cve": "CVE-2016-10556",
    "year": "2016",
    "description": "sequelize is an Object-relational mapping, or a middleman to convert things from Postgres, MySQL, MariaDB, SQLite and Microsoft SQL Server into usable data for NodeJS In Postgres, SQLite, and Microsoft SQL Server there is an issue where arrays are treated as strings and improperly escaped. This causes potential SQL injection in sequelize 3.19.3 and earlier, where a malicious user could put `[\"test\", \"'); DELETE TestTable WHERE Id = 1 --')\"]` inside of ``` database.query('SELECT * FROM TestTable WHERE Name IN (:names)', { replacements: { names: directCopyOfUserInput } }); ``` and cause the SQL statement to become `SELECT Id FROM Table WHERE Name IN ('test', '\\'); DELETE TestTable WHERE Id = 1 --')`. In Postgres, MSSQL, and SQLite, the backslash has no special meaning. This causes the the statement to delete whichever Id has a value of 1 in the TestTable table.",
    "severity": "HIGH",
    "url": "https://github.com/sequelize/sequelize/issues/5671"
  },
  {
    "cve": "CVE-2016-10557",
    "year": "2016",
    "description": "appium-chromedriver is a Node.js wrapper around Chromedriver. Versions below 2.9.4 download binary resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/162"
  },
  {
    "cve": "CVE-2016-10558",
    "year": "2016",
    "description": "aerospike is an Aerospike add-on module for Node.js. aerospike versions below 2.4.2 download binary resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/167"
  },
  {
    "cve": "CVE-2016-10559",
    "year": "2016",
    "description": "selenium-download downloads the latest versions of the selenium standalone server and the chromedriver. selenium-download before 2.0.7 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/164"
  },
  {
    "cve": "CVE-2016-10560",
    "year": "2016",
    "description": "galenframework-cli is the node wrapper for the Galen Framework. galenframework-cli below 2.3.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/170"
  },
  {
    "cve": "CVE-2016-10561",
    "year": "2016",
    "description": "Bitty is a development web server tool that functions similar to `python -m SimpleHTTPServer`. Version 0.2.10 has a directory traversal vulnerability that is exploitable via the URL path in GET requests.",
    "severity": "MEDIUM",
    "url": "https://nodesecurity.io/advisories/150"
  },
  {
    "cve": "CVE-2016-10562",
    "year": "2016",
    "description": "iedriver is an NPM wrapper for Selenium IEDriver. iedriver versions below 3.0.0 download binary resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/174"
  },
  {
    "cve": "CVE-2016-10564",
    "year": "2016",
    "description": "apk-parser is a tool to extract Android Manifest info from an APK file. apk-parser versions below 0.1.6 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/195"
  },
  {
    "cve": "CVE-2016-10565",
    "year": "2016",
    "description": "operadriver is a Opera Driver for Selenium. operadriver versions below 0.2.3 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/196"
  },
  {
    "cve": "CVE-2016-10566",
    "year": "2016",
    "description": "install-nw is a module which quickly and robustly installs and caches NW.js. install-nw versions below 1.1.5 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/204"
  },
  {
    "cve": "CVE-2016-10567",
    "year": "2016",
    "description": "product-monitor is a HTML/JavaScript template for monitoring a product by encouraging product developers to gather all the information about the status of a product, including live monitoring, statistics, endpoints, and test results into one place. product-monitor versions below 2.2.5 download JavaScript resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested JavaScript file with an attacker controlled JavaScript file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/171"
  },
  {
    "cve": "CVE-2016-10568",
    "year": "2016",
    "description": "geoip-lite-country is a stripped down version of geoip-lite, supporting only country lookup. geoip-lite-country before 1.1.4 downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/183"
  },
  {
    "cve": "CVE-2016-10569",
    "year": "2016",
    "description": "embedza is a module to create HTML snippets/embeds from URLs using info from oEmbed, Open Graph, meta tags. embedza versions below 1.2.4 download JavaScript resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested JavaScript file with an attacker controlled JavaScript file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/187"
  },
  {
    "cve": "CVE-2016-10570",
    "year": "2016",
    "description": "pngcrush-installer is an installer for Pngcrush. pngcrush-installer versions below 1.8.10 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/189"
  },
  {
    "cve": "CVE-2016-10571",
    "year": "2016",
    "description": "bkjs-wand is imagemagick wand support for node.js and backendjs bkjs-wand versions lower than 0.3.2 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/220"
  },
  {
    "cve": "CVE-2016-10572",
    "year": "2016",
    "description": "mongodb-instance before 0.0.3 installs mongodb locally. mongodb-instance downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/235"
  },
  {
    "cve": "CVE-2016-10573",
    "year": "2016",
    "description": "baryton-saxophone is a module to install and launch Selenium Server for Mac, Linux and Windows. baryton-saxophone versions below 3.0.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/240"
  },
  {
    "cve": "CVE-2016-10574",
    "year": "2016",
    "description": "apk-parser3 is a module to extract Android Manifest info from an APK file. apk-parser3 versions before 0.1.3 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/245"
  },
  {
    "cve": "CVE-2016-10575",
    "year": "2016",
    "description": "Kindlegen is a simple Node.js wrapper of the official kindlegen program. Kindlegen versions before 1.1.0 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/251"
  },
  {
    "cve": "CVE-2016-10576",
    "year": "2016",
    "description": "Fuseki server wrapper and management API in fuseki before 1.0.1 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/278"
  },
  {
    "cve": "CVE-2016-10577",
    "year": "2016",
    "description": "ibm_db is an asynchronous/synchronous interface for node.js to IBM DB2 and IBM Informix. ibm_db before 1.0.2 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://github.com/ibmdb/node-ibm_db/commit/d7e2d4b4cbeb6f067df8bba7d0b2ac5d40fcfc19#diff-315091eb1586966006e05ebc21cd2a94"
  },
  {
    "cve": "CVE-2016-10578",
    "year": "2016",
    "description": "unicode loads unicode data downloaded from unicode.org into nodejs. Unicode before 9.0.0 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/161"
  },
  {
    "cve": "CVE-2016-10579",
    "year": "2016",
    "description": "Chromedriver is an NPM wrapper for selenium ChromeDriver. Chromedriver before 2.26.1 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/160"
  },
  {
    "cve": "CVE-2016-10580",
    "year": "2016",
    "description": "nodewebkit is an installer for node-webkit. nodewebkit downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/173"
  },
  {
    "cve": "CVE-2016-10581",
    "year": "2016",
    "description": "Steroids is PhoneGap on Steroids, providing native UI elements, multiple WebViews and enhancements for better developer productivity. steroids downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested tarball with an attacker controlled tarball if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/168"
  },
  {
    "cve": "CVE-2016-10582",
    "year": "2016",
    "description": "closurecompiler is a Closure Compiler for node.js. closurecompiler downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/169"
  },
  {
    "cve": "CVE-2016-10583",
    "year": "2016",
    "description": "closure-utils is Utilities for Closure Library based projects. closure-utils downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/165"
  },
  {
    "cve": "CVE-2016-10584",
    "year": "2016",
    "description": "dalek-browser-chrome-canary provides Google Chrome bindings for DalekJS. dalek-browser-chrome-canary downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/181"
  },
  {
    "cve": "CVE-2016-10585",
    "year": "2016",
    "description": "libxl provides Node bindings for the libxl library for reading and writing excel (XLS and XLSX) spreadsheets. libxl downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/178"
  },
  {
    "cve": "CVE-2016-10586",
    "year": "2016",
    "description": "macaca-chromedriver is a Node.js wrapper for the selenium chromedriver. macaca-chromedriver before 1.0.29 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/180"
  },
  {
    "cve": "CVE-2016-10587",
    "year": "2016",
    "description": "wasdk is a toolkit for creating WebAssembly modules. wasdk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/179"
  },
  {
    "cve": "CVE-2016-10588",
    "year": "2016",
    "description": "nw is an installer for nw.js. nw downloads zipped resources over HTTP, It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/166"
  },
  {
    "cve": "CVE-2016-10589",
    "year": "2016",
    "description": "selenium-binaries downloads Selenium related binaries for your OS. selenium-binaries downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/175"
  },
  {
    "cve": "CVE-2016-10590",
    "year": "2016",
    "description": "cue-sdk-node is a Corsair Cue SDK wrapper for node.js. cue-sdk-node downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/190"
  },
  {
    "cve": "CVE-2016-10591",
    "year": "2016",
    "description": "Prince is a Node API for executing XML/HTML to PDF renderer PrinceXML via prince(1) CLI. prince downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested tarball with an attacker controlled tarball if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/185"
  },
  {
    "cve": "CVE-2016-10592",
    "year": "2016",
    "description": "jser-stat is a JSer.info stat library. jser-stat downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://github.com/jser/stat-js/blob/master/data/url-mapping.js"
  },
  {
    "cve": "CVE-2016-10593",
    "year": "2016",
    "description": "ibapi is an Interactive Brokers API addon for NodeJS. ibapi downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. Before 2.5.6, it may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://gitlord.com/commitdiff/~dchem%2Fnode-ibapi-addon.git/c00dd7c98cca0423052148337e523eeb7776da68"
  },
  {
    "cve": "CVE-2016-10594",
    "year": "2016",
    "description": "ipip is a Node.js module to query geolocation information for an IP or domain, based on database by ipip.net. ipip downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/184"
  },
  {
    "cve": "CVE-2016-10595",
    "year": "2016",
    "description": "jdf-sass is a fork from node-sass, jdf use only. jdf-sass downloads executable resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested file with an attacker controlled file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/198"
  },
  {
    "cve": "CVE-2016-10596",
    "year": "2016",
    "description": "imageoptim is a Node.js wrapper for some images compression algorithms. imageoptim downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested tarball with an attacker controlled tarball if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/194"
  },
  {
    "cve": "CVE-2016-10597",
    "year": "2016",
    "description": "cobalt-cli downloads resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "MEDIUM",
    "url": "https://nodesecurity.io/advisories/197"
  },
  {
    "cve": "CVE-2016-10598",
    "year": "2016",
    "description": "arrayfire-js is a module for ArrayFire for the Node.js platform. arrayfire-js downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/192"
  },
  {
    "cve": "CVE-2016-10599",
    "year": "2016",
    "description": "sauce-connect is a Node.js wrapper over the SauceLabs SauceConnect.jar program for establishing a secure tunnel for intranet testing. sauce-connect downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/186"
  },
  {
    "cve": "CVE-2016-10600",
    "year": "2016",
    "description": "webrtc-native uses WebRTC from chromium project. webrtc-native downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/176"
  },
  {
    "cve": "CVE-2016-10601",
    "year": "2016",
    "description": "webdrvr is a npm wrapper for Selenium Webdriver including Chromedriver / IEDriver / IOSDriver / Ghostdriver. webdrvr downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/193"
  },
  {
    "cve": "CVE-2016-10602",
    "year": "2016",
    "description": "haxe is a cross-platform toolkit haxe downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/177"
  },
  {
    "cve": "CVE-2016-10603",
    "year": "2016",
    "description": "air-sdk is a NPM wrapper for the Adobe AIR SDK. air-sdk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/200"
  },
  {
    "cve": "CVE-2016-10604",
    "year": "2016",
    "description": "dalek-browser-chrome is Google Chrome bindings for DalekJS. dalek-browser-chrome downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/199"
  },
  {
    "cve": "CVE-2016-10605",
    "year": "2016",
    "description": "dalek-browser-ie is Internet Explorer bindings for DalekJS. dalek-browser-ie downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/209"
  },
  {
    "cve": "CVE-2016-10606",
    "year": "2016",
    "description": "grunt-webdriver-qunit is a grunt plugin to run qunit with webdriver in grunt grunt-webdriver-qunit downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/207"
  },
  {
    "cve": "CVE-2016-10607",
    "year": "2016",
    "description": "openframe-glsviewer is a Openframe extension which adds support for shaders via glslViewer. openframe-glsviewer downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/208"
  },
  {
    "cve": "CVE-2016-10608",
    "year": "2016",
    "description": "robot-js is a module for native system automation for node.js. robot-js downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/201"
  },
  {
    "cve": "CVE-2016-10609",
    "year": "2016",
    "description": "chromedriver126 is chromedriver version 1.26 for linux OS. chromedriver126 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/203"
  },
  {
    "cve": "CVE-2016-10610",
    "year": "2016",
    "description": "unicode-json is a unicode lookup table. unicode-json before 2.0.0 downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/206"
  },
  {
    "cve": "CVE-2016-10611",
    "year": "2016",
    "description": "strider-sauce is Sauce Labs / Selenium support for Strider. strider-sauce downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/202"
  },
  {
    "cve": "CVE-2016-10612",
    "year": "2016",
    "description": "dalek-browser-ie-canary is Internet Explorer bindings for DalekJS. dalek-browser-ie-canary downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/205"
  },
  {
    "cve": "CVE-2016-10613",
    "year": "2016",
    "description": "bionode-sra is a Node.js wrapper for SRA Toolkit. bionode-sra downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "MEDIUM",
    "url": "https://nodesecurity.io/advisories/211"
  },
  {
    "cve": "CVE-2016-10614",
    "year": "2016",
    "description": "httpsync is a port of libcurl to node.js. httpsync downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/210"
  },
  {
    "cve": "CVE-2016-10615",
    "year": "2016",
    "description": "curses is bindings for the native curses library, a full featured console IO library. curses downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/215"
  },
  {
    "cve": "CVE-2016-10616",
    "year": "2016",
    "description": "openframe-image is an Openframe extension which adds support for images via fbi. openframe-image downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/218"
  },
  {
    "cve": "CVE-2016-10617",
    "year": "2016",
    "description": "box2d-native downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/219"
  },
  {
    "cve": "CVE-2016-10618",
    "year": "2016",
    "description": "node-browser is a wrapper webdriver by nodejs. node-browser downloads resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/214"
  },
  {
    "cve": "CVE-2016-10619",
    "year": "2016",
    "description": "pennyworth is a natural language templating engine. pennyworth downloads data resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/213"
  },
  {
    "cve": "CVE-2016-10620",
    "year": "2016",
    "description": "atom-node-module-installer installs node modules for atom-shell applications. atom-node-module-installer binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/216"
  },
  {
    "cve": "CVE-2016-10621",
    "year": "2016",
    "description": "fibjs is a runtime for javascript applictions built on google v8 JS. fibjs downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/217"
  },
  {
    "cve": "CVE-2016-10622",
    "year": "2016",
    "description": "nodeschnaps is a NodeJS compatibility layer for Java (Rhino). nodeschnaps downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/212"
  },
  {
    "cve": "CVE-2016-10623",
    "year": "2016",
    "description": "macaca-chromedriver-zxa is a Node.js wrapper for the selenium chromedriver. macaca-chromedriver-zxa downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/221"
  },
  {
    "cve": "CVE-2016-10624",
    "year": "2016",
    "description": "selenium-chromedriver is a simple utility for downloading the Selenium Webdriver for Google Chrome selenium-chromedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/222"
  },
  {
    "cve": "CVE-2016-10625",
    "year": "2016",
    "description": "headless-browser-lite is a minimal npm installer for phantomjs and slimerjs with no external dependencies. headless-browser-lite downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/230"
  },
  {
    "cve": "CVE-2016-10626",
    "year": "2016",
    "description": "mystem3 is a NodeJS wrapper for the Yandex MyStem 3. mystem3 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/229"
  },
  {
    "cve": "CVE-2016-10627",
    "year": "2016",
    "description": "scala-bin is a binary wrapper for Scala. scala-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/227"
  },
  {
    "cve": "CVE-2016-10628",
    "year": "2016",
    "description": "selenium-wrapper is a selenium server wrapper, including installation and chrome webdriver. selenium-wrapper downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/224"
  },
  {
    "cve": "CVE-2016-10629",
    "year": "2016",
    "description": "nw-with-arm is a NW Installer including ARM-Build. nw-with-arm downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/226"
  },
  {
    "cve": "CVE-2016-10630",
    "year": "2016",
    "description": "install-g-test downloads resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "MEDIUM",
    "url": "https://nodesecurity.io/advisories/228"
  },
  {
    "cve": "CVE-2016-10631",
    "year": "2016",
    "description": "jvminstall is a module for downloading and unpacking jvm to local system. jvminstall downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/225"
  },
  {
    "cve": "CVE-2016-10632",
    "year": "2016",
    "description": "apk-parser2 is a module which extracts Android Manifest info from an APK file. apk-parser2 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/223"
  },
  {
    "cve": "CVE-2016-10633",
    "year": "2016",
    "description": "dwebp-bin is a dwebp node.js wrapper that convert WebP into PNG. dwebp-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/232"
  },
  {
    "cve": "CVE-2016-10634",
    "year": "2016",
    "description": "scala-standalone-bin is a Binary wrapper for ScalaJS. scala-standalone-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/231"
  },
  {
    "cve": "CVE-2016-10635",
    "year": "2016",
    "description": "broccoli-closure is a Closure compiler plugin for Broccoli. broccoli-closure before 1.3.1 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/242"
  },
  {
    "cve": "CVE-2016-10636",
    "year": "2016",
    "description": "grunt-ccompiler is a Closure Compiler Grunt Plugin. grunt-ccompiler downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/239"
  },
  {
    "cve": "CVE-2016-10637",
    "year": "2016",
    "description": "haxe-dev is a cross-platform toolkit. haxe-dev downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/237"
  },
  {
    "cve": "CVE-2016-10638",
    "year": "2016",
    "description": "js-given is a JavaScript frontend to jgiven. js-given downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/241"
  },
  {
    "cve": "CVE-2016-10639",
    "year": "2016",
    "description": "redis-srvr is a npm wrapper for redis-server. redis-srvr downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/238"
  },
  {
    "cve": "CVE-2016-10640",
    "year": "2016",
    "description": "node-thulac is a node binding for thulac. node-thulac downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/236"
  },
  {
    "cve": "CVE-2016-10641",
    "year": "2016",
    "description": "node-bsdiff-android downloads resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/234"
  },
  {
    "cve": "CVE-2016-10642",
    "year": "2016",
    "description": "cmake installs the cmake x86 linux binaries. cmake downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/233"
  },
  {
    "cve": "CVE-2016-10643",
    "year": "2016",
    "description": "jstestdriver is a wrapper for Google's jstestdriver. jstestdriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/244"
  },
  {
    "cve": "CVE-2016-10644",
    "year": "2016",
    "description": "slimerjs-edge is a npm wrapper for installing the bleeding edge version of slimerjs. slimerjs-edge downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/243"
  },
  {
    "cve": "CVE-2016-10645",
    "year": "2016",
    "description": "grunt-images is a grunt plugin for processing images. grunt-images downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/255"
  },
  {
    "cve": "CVE-2016-10646",
    "year": "2016",
    "description": "resourcehacker is a Node wrapper of Resource Hacker (windows executable resource editor). resourcehacker downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/254"
  },
  {
    "cve": "CVE-2016-10647",
    "year": "2016",
    "description": "node-air-sdk is an AIR SDK for nodejs. node-air-sdk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/250"
  },
  {
    "cve": "CVE-2016-10648",
    "year": "2016",
    "description": "marionette-socket-host is a marionette-js-runner host for sending actions over a socket. marionette-socket-host downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/252"
  },
  {
    "cve": "CVE-2016-10649",
    "year": "2016",
    "description": "frames-compiler downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/247"
  },
  {
    "cve": "CVE-2016-10650",
    "year": "2016",
    "description": "ntfserver is a Network Testing Framework Server. ntfserver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/253"
  },
  {
    "cve": "CVE-2016-10651",
    "year": "2016",
    "description": "webdriver-launcher is a Node.js Selenium Webdriver Launcher. webdriver-launcher downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/246"
  },
  {
    "cve": "CVE-2016-10652",
    "year": "2016",
    "description": "prebuild-lwip is a module for comprehensive, fast, and simple image processing and manipulation. prebuild-lwip downloads resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/248"
  },
  {
    "cve": "CVE-2016-10653",
    "year": "2016",
    "description": "xd-testing is a testing library for cross-device (XD) web applications. xd-testing downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/257"
  },
  {
    "cve": "CVE-2016-10654",
    "year": "2016",
    "description": "sfml downloads resources over HTTP, which leaves it vulnerable to MITM attacks.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/256"
  },
  {
    "cve": "CVE-2016-10655",
    "year": "2016",
    "description": "The clang-extra module installs LLVM's clang-extra tools. clang-extra downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/265"
  },
  {
    "cve": "CVE-2016-10656",
    "year": "2016",
    "description": "qbs is a build tool that helps simplify the build process for developing projects across multiple platforms. qbs downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/266"
  },
  {
    "cve": "CVE-2016-10657",
    "year": "2016",
    "description": "co-cli-installer downloads the co-cli module as part of the install process, but does so over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/268"
  },
  {
    "cve": "CVE-2016-10658",
    "year": "2016",
    "description": "native-opencv is the OpenCV library installed via npm native-opencv downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/263"
  },
  {
    "cve": "CVE-2016-10659",
    "year": "2016",
    "description": "poco - The POCO libraries, downloads source file resources used for compilation over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/271"
  },
  {
    "cve": "CVE-2016-10660",
    "year": "2016",
    "description": "fis-parser-sass-bin a plugin for fis to compile sass using node-sass-binaries. fis-parser-sass-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/269"
  },
  {
    "cve": "CVE-2016-10661",
    "year": "2016",
    "description": "phantomjs-cheniu is a Headless WebKit with JS API phantomjs-cheniu downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/262"
  },
  {
    "cve": "CVE-2016-10662",
    "year": "2016",
    "description": "tomita is a node wrapper for Yandex Tomita Parser tomita downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/267"
  },
  {
    "cve": "CVE-2016-10663",
    "year": "2016",
    "description": "wixtoolset is a Node module wrapper around the wixtoolset binaries wixtoolset downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://github.com/wixtoolset/issues/issues/6187"
  },
  {
    "cve": "CVE-2016-10664",
    "year": "2016",
    "description": "mystem is a Node.js wrapper for MyStem morphology text analyzer by Yandex.ru mystem downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/259"
  },
  {
    "cve": "CVE-2016-10665",
    "year": "2016",
    "description": "herbivore is a packet sniffing and crafting library. Built on libtins herbivore 0.0.3 and below download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://github.com/samatt/Herbivore/commit/0a041defc3463e99948e5d2064aef54b2128c5a3"
  },
  {
    "cve": "CVE-2016-10666",
    "year": "2016",
    "description": "tomita-parser is a Node wrapper for Yandex Tomita Parser tomita-parser downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/261"
  },
  {
    "cve": "CVE-2016-10667",
    "year": "2016",
    "description": "selenium-portal is a Selenium Testing Framework selenium-portal downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/260"
  },
  {
    "cve": "CVE-2016-10668",
    "year": "2016",
    "description": "libsbml is a module that installs Linux binaries for libSBML libsbml downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/272"
  },
  {
    "cve": "CVE-2016-10669",
    "year": "2016",
    "description": "soci downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/270"
  },
  {
    "cve": "CVE-2016-10670",
    "year": "2016",
    "description": "windows-seleniumjar-mirror downloads the Selenium Jar file windows-seleniumjar-mirror downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/281"
  },
  {
    "cve": "CVE-2016-10671",
    "year": "2016",
    "description": "mystem-wrapper is a Yandex mystem app wrapper module. mystem-wrapper downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/280"
  },
  {
    "cve": "CVE-2016-10672",
    "year": "2016",
    "description": "cloudpub-redis is a module for CloudPub: Redis Backend cloudpub-redis downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/282"
  },
  {
    "cve": "CVE-2016-10673",
    "year": "2016",
    "description": "ipip-coffee queries geolocation information from IP ipip-coffee downloads geolocation resources over HTTP, which leaves it vulnerable to MITM attacks. This could impact the integrity and availability of the data being used to make geolocation decisions by an application.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/279"
  },
  {
    "cve": "CVE-2016-10674",
    "year": "2016",
    "description": "limbus-buildgen is a \"build anywhere\" build system. limbus-buildgen versions below 0.1.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/276"
  },
  {
    "cve": "CVE-2016-10675",
    "year": "2016",
    "description": "libsbmlsim is a module that installs linux binaries for libsbmlsim libsbmlsim downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/275"
  },
  {
    "cve": "CVE-2016-10676",
    "year": "2016",
    "description": "rs-brightcove is a wrapper around brightcove's web api rs-brightcove downloads source file resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/273"
  },
  {
    "cve": "CVE-2016-10677",
    "year": "2016",
    "description": "google-closure-tools-latest is a Node.js module wrapper for downloading the latest version of the Google Closure tools google-closure-tools-latest downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/274"
  },
  {
    "cve": "CVE-2016-10678",
    "year": "2016",
    "description": "serc.js is a Selenium RC process wrapper serc.js downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/277"
  },
  {
    "cve": "CVE-2016-10679",
    "year": "2016",
    "description": "selenium-standalone-painful installs a start-selenium command line to start a standalone selenium server with chrome-driver. selenium-standalone-painful downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/284"
  },
  {
    "cve": "CVE-2016-10680",
    "year": "2016",
    "description": "adamvr-geoip-lite is a light weight native JavaScript implementation of GeoIP API from MaxMind adamvr-geoip-lite downloads geoip resources over HTTP, which leaves it vulnerable to MITM attacks. This impacts the integrity and availability of this geoip data that may alter the decisions made by an application using this data.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/283"
  },
  {
    "cve": "CVE-2016-10681",
    "year": "2016",
    "description": "roslib-socketio - The standard ROS Javascript Library fork for add support to socket.io roslib-socketio downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/292"
  },
  {
    "cve": "CVE-2016-10682",
    "year": "2016",
    "description": "massif is a Phantomjs fork massif downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/290"
  },
  {
    "cve": "CVE-2016-10683",
    "year": "2016",
    "description": "arcanist downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/286"
  },
  {
    "cve": "CVE-2016-10684",
    "year": "2016",
    "description": "healthcenter - IBM Monitoring and Diagnostic Tools health Center agent healthcenter downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/288"
  },
  {
    "cve": "CVE-2016-10685",
    "year": "2016",
    "description": "pk-app-wonderbox is an integration with wonderbox pk-app-wonderbox downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/289"
  },
  {
    "cve": "CVE-2016-10686",
    "year": "2016",
    "description": "fis-sass-all is another libsass wrapper for node. fis-sass-all downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/287"
  },
  {
    "cve": "CVE-2016-10687",
    "year": "2016",
    "description": "windows-selenium-chromedriver is a module that downloads the Selenium Jar file. windows-selenium-chromedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/285"
  },
  {
    "cve": "CVE-2016-10688",
    "year": "2016",
    "description": "Haxe 3 : The Cross-Platform Toolkit (a fork from David Mouton's damoebius/haxe-npm) haxe3 downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/294"
  },
  {
    "cve": "CVE-2016-10689",
    "year": "2016",
    "description": "The windows-iedriver module downloads fixed version of iedriverserver.exe windows-iedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/293"
  },
  {
    "cve": "CVE-2016-10690",
    "year": "2016",
    "description": "openframe-ascii-image module is an openframe plugin which adds support for ascii images via fim. openframe-ascii-image downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/298"
  },
  {
    "cve": "CVE-2016-10691",
    "year": "2016",
    "description": "windows-seleniumjar is a module that downloads the Selenium Jar file windows-seleniumjar downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/296"
  },
  {
    "cve": "CVE-2016-10692",
    "year": "2016",
    "description": "haxeshim haxe shim to deal with coexisting versions. haxeshim downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/300"
  },
  {
    "cve": "CVE-2016-10693",
    "year": "2016",
    "description": "pm2-kafka is a PM2 module that installs and runs a kafka server pm2-kafka downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/299"
  },
  {
    "cve": "CVE-2016-10694",
    "year": "2016",
    "description": "alto-saxophone is a module to install and launch Chromedriver for Mac, Linux or Windows. alto-saxophone versions below 2.25.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/172"
  },
  {
    "cve": "CVE-2016-10695",
    "year": "2016",
    "description": "The npm-test-sqlite3-trunk module provides asynchronous, non-blocking SQLite3 bindings. npm-test-sqlite3-trunk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/297"
  },
  {
    "cve": "CVE-2016-10696",
    "year": "2016",
    "description": "windows-latestchromedriver downloads the latest version of chromedriver.exe. windows-latestchromedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/295"
  },
  {
    "cve": "CVE-2016-10697",
    "year": "2016",
    "description": "react-native-baidu-voice-synthesizer is a baidu voice speech synthesizer for react native. react-native-baidu-voice-synthesizer downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/302"
  },
  {
    "cve": "CVE-2016-10698",
    "year": "2016",
    "description": "mystem-fix is a node.js wrapper for MyStem morphology text analyzer by Yandex.ru mystem-fix downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server.",
    "severity": "HIGH",
    "url": "https://nodesecurity.io/advisories/301"
  },
  {
    "cve": "CVE-2016-10707",
    "year": "2016",
    "description": "jQuery 3.0.0-rc.1 is vulnerable to Denial of Service (DoS) due to removing a logic that lowercased attribute names. Any attribute getter using a mixed-cased name for boolean attributes goes into an infinite recursion, exceeding the stack call limit.",
    "severity": "HIGH",
    "url": "https://github.com/jquery/jquery/issues/3133"
  },
  {
    "cve": "CVE-2016-10721",
    "year": "2016",
    "description": "partclone.restore in Partclone 0.2.87 is prone to a heap-based buffer overflow vulnerability due to insufficient validation of the partclone image header. An attacker may be able to execute arbitrary code in the context of the user running the affected application.",
    "severity": "CRITICAL",
    "url": "https://github.com/Thomas-Tsai/partclone/issues/82"
  },
  {
    "cve": "CVE-2016-10722",
    "year": "2016",
    "description": "partclone.fat in Partclone before 0.2.88 is prone to a heap-based buffer overflow vulnerability due to insufficient validation of the FAT superblock, related to the mark_reserved_sectors function. An attacker may be able to execute arbitrary code in the context of the user running the affected application.",
    "severity": "CRITICAL",
    "url": "https://david.gnedt.at/blog/2016/11/14/advisory-partclone-fat-bitmap-heap-overflow/"
  },
  {
    "cve": "CVE-2016-10723",
    "year": "2016",
    "description": "An issue was discovered in the Linux kernel through 4.17.2. Since the page allocator does not yield CPU resources to the owner of the oom_lock mutex, a local unprivileged user can trivially lock up the system forever by wasting CPU resources from the page allocator (e.g., via concurrent page fault events) when the global OOM killer is invoked. NOTE: the software maintainer has not accepted certain proposed patches, in part because of a viewpoint that \"the underlying problem is non-trivial to handle.",
    "severity": "MEDIUM",
    "url": "https://patchwork.kernel.org/patch/10395909/"
  },
  {
    "cve": "CVE-2016-10725",
    "year": "2016",
    "description": "In Bitcoin Core before v0.13.0, a non-final alert is able to block the special \"final alert\" (which is supposed to override all other alerts) because operations occur in the wrong order. This behavior occurs in the remote network alert system (deprecated since Q1 2016). This affects other uses of the codebase, such as Bitcoin Knots before v0.13.0.knots20160814 and many altcoins.",
    "severity": "HIGH",
    "url": "https://bitcoin.org/en/posts/alert-key-and-vulnerabilities-disclosure"
  },
  {
    "cve": "CVE-2016-10735",
    "year": "2016",
    "description": "In Bootstrap 3.x before 3.4.0 and 4.x-beta before 4.0.0-beta.2, XSS is possible in the data-target attribute, a different vulnerability than CVE-2018-14041.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHBA-2019:1076"
  },
  {
    "cve": "CVE-2016-10750",
    "year": "2016",
    "description": "In Hazelcast before 3.11, the cluster join procedure is vulnerable to remote code execution via Java deserialization. If an attacker can reach a listening Hazelcast instance with a crafted JoinRequest, and vulnerable classes exist in the classpath, the attacker can run arbitrary code.",
    "severity": "HIGH",
    "url": "https://access.redhat.com/errata/RHSA-2019:2413"
  },
  {
    "cve": "CVE-2016-10751",
    "year": "2016",
    "description": "osClass 3.6.1 allows oc-admin/plugins.php Directory Traversal via the plugin parameter. This is exploitable for remote PHP code execution because an administrator can upload an image that contains PHP code in the EXIF data via index.php?page=ajax&action=ajax_upload.",
    "severity": "HIGH",
    "url": "https://blog.ripstech.com/2016/osclass-remote-code-execution-via-image-file/"
  },
  {
    "cve": "CVE-2016-10778",
    "year": "2016",
    "description": "cPanel before 60.0.25 allows self stored XSS in the listftpstable API (SEC-178).",
    "severity": "MEDIUM",
    "url": "https://documentation.cpanel.net/display/CL/60+Change+Log"
  },
  {
    "cve": "CVE-2016-10791",
    "year": "2016",
    "description": "cPanel before 60.0.15 does not ensure that system accounts lack a valid password, so that logins are impossible (CPANEL-9559).",
    "severity": "MEDIUM",
    "url": "https://documentation.cpanel.net/display/CL/60+Change+Log"
  },
  {
    "cve": "CVE-2016-10812",
    "year": "2016",
    "description": "In cPanel before 57.9999.54, /scripts/enablefileprotect exposed TTYs (SEC-117).",
    "severity": "HIGH",
    "url": "https://documentation.cpanel.net/display/CL/58+Change+Log"
  },
  {
    "cve": "CVE-2016-10819",
    "year": "2016",
    "description": "In cPanel before 57.9999.54, user log files become world-readable when rotated by cpanellogd (SEC-125).",
    "severity": "MEDIUM",
    "url": "https://news.cpanel.com/cpanel-tsr-2016-0003-full-disclosure/"
  },
  {
    "cve": "CVE-2016-10845",
    "year": "2016",
    "description": "cPanel before 11.54.0.4 allows arbitrary file-overwrite operations in scripts/check_system_storable (SEC-78).",
    "severity": "HIGH",
    "url": "https://documentation.cpanel.net/display/CL/54+Change+Log"
  },
  {
    "cve": "CVE-2016-10941",
    "year": "2016",
    "description": "The podlove-podcasting-plugin-for-wordpress plugin before 2.3.16 for WordPress has XSS exploitable via CSRF.",
    "severity": "MEDIUM",
    "url": "https://blog.ripstech.com/2016/the-state-of-wordpress-security/"
  },
  {
    "cve": "CVE-2016-10942",
    "year": "2016",
    "description": "The podlove-podcasting-plugin-for-wordpress plugin before 2.3.16 for WordPress has SQL injection via the insert_id parameter exploitable via CSRF.",
    "severity": "CRITICAL",
    "url": "https://blog.ripstech.com/2016/the-state-of-wordpress-security/"
  },
  {
    "cve": "CVE-2016-10959",
    "year": "2016",
    "description": "The estatik plugin before 2.3.1 for WordPress has authenticated arbitrary file upload (exploitable with CSRF) via es_media_images[] to wp-admin/admin-ajax.php.",
    "severity": "MEDIUM",
    "url": "https://wordpress.org/plugins/estatik/#developers"
  },
  {
    "cve": "CVE-2016-11032",
    "year": "2016",
    "description": "An issue was discovered on Samsung mobile devices with M(6.0) software. An attacker can disable all Sound functionality by broadcasting an unprotected intent. The Samsung IDs are SVE-2016-7179 and SVE-2016-7182 (November 2016).",
    "severity": "MEDIUM",
    "url": "https://security.samsungmobile.com/securityUpdate.smsb"
  },
  {
    "cve": "CVE-2016-1159",
    "year": "2016",
    "description": "In ZOHO Password Manager Pro (PMP) 8.3.0 (Build 8303) and 8.4.0 (Build 8400,8401,8402), underprivileged users can obtain sensitive information (entry password history) via a vulnerable hidden service.",
    "severity": "MEDIUM",
    "url": "http://jvn.jp/vu/JVNVU90405898/index.html"
  },
  {
    "cve": "CVE-2016-15002",
    "year": "2016",
    "description": "A vulnerability, which was classified as critical, was found in MONyog Ultimate 6.63. This affects an unknown part of the component Cookie Handler. The manipulation of the argument HasServerEdit/IsAdmin leads to privilege escalation. It is possible to initiate the attack remotely.",
    "severity": "HIGH",
    "url": "https://vuldb.com/?id.98355"
  },
  {
    "cve": "CVE-2016-15003",
    "year": "2016",
    "description": "A vulnerability has been found in FileZilla Client 3.17.0.0 and classified as problematic. This vulnerability affects unknown code of the file C:\\Program Files\\FileZilla FTP Client\\uninstall.exe of the component Installer. The manipulation leads to unquoted search path. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.",
    "severity": "HIGH",
    "url": "https://vuldb.com/?id.97204"
  },
  {
    "cve": "CVE-2016-15004",
    "year": "2016",
    "description": "A vulnerability was found in InfiniteWP Client Plugin 1.5.1.3/1.6.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality. The manipulation leads to injection. The attack can be launched remotely. Upgrading to version 1.6.1.1 is able to address this issue. It is recommended to upgrade the affected component.",
    "severity": "CRITICAL",
    "url": "http://seclists.org/fulldisclosure/2017/Jan/72"
  },
  {
    "cve": "CVE-2016-15006",
    "year": "2016",
    "description": "A vulnerability, which was classified as problematic, has been found in enigmaX up to 2.2. This issue affects the function getSeed of the file main.c of the component Scrambling Table Handler. The manipulation leads to predictable seed in pseudo-random number generator (prng). The attack may be initiated remotely. The complexity of an attack is rather high. The exploitation is known to be difficult. Upgrading to version 2.3 is able to address this issue. The identifier of the patch is 922bf90ca14a681629ba0b807a997a81d70225b5. It is recommended to upgrade the affected component. The identifier VDB-217181 was assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/pfmonville/enigmaX/commit/922bf90ca14a681629ba0b807a997a81d70225b5"
  },
  {
    "cve": "CVE-2016-15007",
    "year": "2016",
    "description": "A vulnerability was found in Centralized-Salesforce-Dev-Framework. It has been declared as problematic. Affected by this vulnerability is the function SObjectService of the file src/classes/SObjectService.cls of the component SOQL Handler. The manipulation of the argument orderDirection leads to injection. The patch is named db03ac5b8a9d830095991b529c067a030a0ccf7b. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-217195.",
    "severity": "CRITICAL",
    "url": "https://github.com/scottbcovert/Centralized-Salesforce-Dev-Framework/commit/db03ac5b8a9d830095991b529c067a030a0ccf7b"
  },
  {
    "cve": "CVE-2016-15008",
    "year": "2016",
    "description": "A vulnerability was found in oxguy3 coebot-www and classified as problematic. This issue affects the function displayChannelCommands/displayChannelQuotes/displayChannelAutoreplies/showChannelHighlights/showChannelBoir of the file js/channel.js. The manipulation leads to cross site scripting. The attack may be initiated remotely. The patch is named c1a6c44092585da4236237e0e7da94ee2996a0ca. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-217355.",
    "severity": "MEDIUM",
    "url": "https://github.com/oxguy3/coebot-www/commit/c1a6c44092585da4236237e0e7da94ee2996a0ca"
  },
  {
    "cve": "CVE-2016-15009",
    "year": "2016",
    "description": "A vulnerability classified as problematic has been found in OpenACS bug-tracker. Affected is an unknown function of the file lib/nav-bar.adp of the component Search. The manipulation leads to cross-site request forgery. It is possible to launch the attack remotely. The name of the patch is aee43e5714cd8b697355ec3bf83eefee176d3fc3. It is recommended to apply a patch to fix this issue. The identifier of this vulnerability is VDB-217440.",
    "severity": "HIGH",
    "url": "https://github.com/openacs/bug-tracker/commit/aee43e5714cd8b697355ec3bf83eefee176d3fc3"
  },
  {
    "cve": "CVE-2016-15010",
    "year": "2016",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability classified as problematic was found in University of Cambridge django-ucamlookup up to 1.9.1. Affected by this vulnerability is an unknown functionality of the component Lookup Handler. The manipulation leads to cross site scripting. The attack can be launched remotely. Upgrading to version 1.9.2 is able to address this issue. The identifier of the patch is 5e25e4765637ea4b9e0bf5fcd5e9a922abee7eb3. It is recommended to upgrade the affected component. The identifier VDB-217441 was assigned to this vulnerability. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "severity": "MEDIUM",
    "url": "https://github.com/uisautomation/django-ucamlookup/commit/5e25e4765637ea4b9e0bf5fcd5e9a922abee7eb3"
  },
  {
    "cve": "CVE-2016-15011",
    "year": "2016",
    "description": "A vulnerability classified as problematic was found in e-Contract dssp up to 1.3.1. Affected by this vulnerability is the function checkSignResponse of the file dssp-client/src/main/java/be/e_contract/dssp/client/SignResponseVerifier.java. The manipulation leads to xml external entity reference. Upgrading to version 1.3.2 is able to address this issue. The identifier of the patch is ec4238349691ec66dd30b416ec6eaab02d722302. It is recommended to upgrade the affected component. The identifier VDB-217549 was assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/e-Contract/dssp/commit/ec4238349691ec66dd30b416ec6eaab02d722302"
  },
  {
    "cve": "CVE-2016-15012",
    "year": "2016",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in forcedotcom SalesforceMobileSDK-Windows up to 4.x. It has been rated as critical. This issue affects the function ComputeCountSql of the file SalesforceSDK/SmartStore/Store/QuerySpec.cs. The manipulation leads to sql injection. Upgrading to version 5.0.0 is able to address this issue. The patch is named 83b3e91e0c1e84873a6d3ca3c5887eb5b4f5a3d8. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-217619. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "severity": "CRITICAL",
    "url": "https://github.com/forcedotcom/SalesforceMobileSDK-Windows/commit/83b3e91e0c1e84873a6d3ca3c5887eb5b4f5a3d8"
  },
  {
    "cve": "CVE-2016-15014",
    "year": "2016",
    "description": "A vulnerability has been found in CESNET theme-cesnet up to 1.x on ownCloud and classified as problematic. Affected by this vulnerability is an unknown functionality of the file cesnet/core/lostpassword/templates/resetpassword.php. The manipulation leads to insufficiently protected credentials. Attacking locally is a requirement. Upgrading to version 2.0.0 is able to address this issue. The identifier of the patch is 2b857f2233ce5083b4d5bc9bfc4152f933c3e4a6. It is recommended to upgrade the affected component. The identifier VDB-217633 was assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/CESNET/theme-cesnet/commit/2b857f2233ce5083b4d5bc9bfc4152f933c3e4a6"
  },
  {
    "cve": "CVE-2016-15015",
    "year": "2016",
    "description": "A vulnerability, which was classified as problematic, was found in viafintech Barzahlen Payment Module PHP SDK up to 2.0.0. Affected is the function verify of the file src/Webhook.php. The manipulation leads to observable timing discrepancy. The complexity of an attack is rather high. The exploitability is told to be difficult. Upgrading to version 2.0.1 is able to address this issue. The patch is identified as 3e7d29dc0ca6c054a6d6e211f32dae89078594c1. It is recommended to upgrade the affected component. VDB-217650 is the identifier assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/viafintech/Barzahlen-PHP/commit/3e7d29dc0ca6c054a6d6e211f32dae89078594c1"
  },
  {
    "cve": "CVE-2016-15016",
    "year": "2016",
    "description": "A vulnerability was found in mrtnmtth joomla_mod_einsatz_stats up to 0.2. It has been classified as critical. This affects the function getStatsByType of the file helper.php. The manipulation of the argument year leads to sql injection. Upgrading to version 0.3 is able to address this issue. The identifier of the patch is 27c1b443cff45c81d9d7d926a74c76f8b6ffc6cb. It is recommended to upgrade the affected component. The identifier VDB-217653 was assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/mrtnmtth/joomla_mod_einsatz_stats/commit/27c1b443cff45c81d9d7d926a74c76f8b6ffc6cb"
  },
  {
    "cve": "CVE-2016-15017",
    "year": "2016",
    "description": "A vulnerability has been found in fabarea media_upload on TYPO3 and classified as critical. This vulnerability affects the function getUploadedFileList of the file Classes/Service/UploadFileService.php. The manipulation leads to pathname traversal. Upgrading to version 0.9.0 is able to address this issue. The patch is identified as b25d42a4981072321c1a363311d8ea2a4ac8763a. It is recommended to upgrade the affected component. VDB-217786 is the identifier assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/fabarea/media_upload/commit/b25d42a4981072321c1a363311d8ea2a4ac8763a"
  },
  {
    "cve": "CVE-2016-15018",
    "year": "2016",
    "description": "A vulnerability was found in krail-jpa up to 0.9.1. It has been classified as critical. This affects an unknown part. The manipulation leads to sql injection. Upgrading to version 0.9.2 is able to address this issue. The identifier of the patch is c1e848665492e21ef6cc9be443205e36b9a1f6be. It is recommended to upgrade the affected component. The identifier VDB-218373 was assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/KrailOrg/krail-jpa/commit/c1e848665492e21ef6cc9be443205e36b9a1f6be"
  },
  {
    "cve": "CVE-2016-15019",
    "year": "2016",
    "description": "A vulnerability was found in tombh jekbox. It has been rated as problematic. This issue affects some unknown processing of the file lib/server.rb. The manipulation leads to exposure of information through directory listing. The attack may be initiated remotely. The patch is named 64eb2677671018fc08b96718b81e3dbc83693190. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-218375.",
    "severity": "HIGH",
    "url": "https://github.com/tombh/jekbox/commit/64eb2677671018fc08b96718b81e3dbc83693190"
  },
  {
    "cve": "CVE-2016-15020",
    "year": "2016",
    "description": "A vulnerability was found in liftkit database up to 2.13.1. It has been classified as critical. This affects the function processOrderBy of the file src/Query/Query.php. The manipulation leads to sql injection. Upgrading to version 2.13.2 is able to address this issue. The patch is named 42ec8f2b22e0b0b98fb5b4444ed451c1b21d125a. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-218391.",
    "severity": "CRITICAL",
    "url": "https://github.com/liftkit/database/commit/42ec8f2b22e0b0b98fb5b4444ed451c1b21d125a"
  },
  {
    "cve": "CVE-2016-15021",
    "year": "2016",
    "description": "A vulnerability was found in nickzren alsdb. It has been rated as critical. This issue affects some unknown processing. The manipulation leads to sql injection. Upgrading to version v2 is able to address this issue. The identifier of the patch is cbc79a68145e845f951113d184b4de207c341599. It is recommended to upgrade the affected component. The identifier VDB-218429 was assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/nickzren/alsdb/commit/cbc79a68145e845f951113d184b4de207c341599"
  },
  {
    "cve": "CVE-2016-15022",
    "year": "2016",
    "description": "A vulnerability was found in mosbth cimage up to 0.7.18. It has been declared as problematic. Affected by this vulnerability is an unknown functionality of the file check_system.php. The manipulation of the argument $_SERVER['SERVER_SOFTWARE'] leads to cross site scripting. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. Upgrading to version 0.7.19 is able to address this issue. The patch is named 401478c8393989836beeddfeac5ce44570af162b. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-219715.",
    "severity": "MEDIUM",
    "url": "https://github.com/mosbth/cimage/commit/401478c8393989836beeddfeac5ce44570af162b"
  },
  {
    "cve": "CVE-2016-15023",
    "year": "2016",
    "description": "A vulnerability, which was classified as problematic, was found in SiteFusion Application Server up to 6.6.6. This affects an unknown part of the file getextension.php of the component Extension Handler. The manipulation leads to path traversal. Upgrading to version 6.6.7 is able to address this issue. The identifier of the patch is 49fff155c303d6cd06ce8f97bba56c9084bf08ac. It is recommended to upgrade the affected component. The identifier VDB-219765 was assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/sitefusion/server/commit/49fff155c303d6cd06ce8f97bba56c9084bf08ac"
  },
  {
    "cve": "CVE-2016-15024",
    "year": "2016",
    "description": "A vulnerability was found in doomsider shadow. It has been classified as problematic. Affected is an unknown function. The manipulation leads to denial of service. Attacking locally is a requirement. The complexity of an attack is rather high. The exploitability is told to be difficult. Continious delivery with rolling releases is used by this product. Therefore, no version details of affected nor updated releases are available. The patch is identified as 3332c5ba9ec3014ddc74e2147190a050eee97bc0. It is recommended to apply a patch to fix this issue. VDB-221478 is the identifier assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/doomsider/shadow/commit/3332c5ba9ec3014ddc74e2147190a050eee97bc0"
  },
  {
    "cve": "CVE-2016-15025",
    "year": "2016",
    "description": "A vulnerability, which was classified as problematic, was found in generator-hottowel 0.0.11. Affected is an unknown function of the file app/templates/src/server/_app.js of the component 404 Error Handler. The manipulation leads to cross site scripting. It is possible to launch the attack remotely. The name of the patch is c17092fd4103143a9ddab93c8983ace8bf174396. It is recommended to apply a patch to fix this issue. The identifier of this vulnerability is VDB-221484.",
    "severity": "MEDIUM",
    "url": "https://github.com/johnpapa/generator-hottowel/commit/c17092fd4103143a9ddab93c8983ace8bf174396"
  },
  {
    "cve": "CVE-2016-15026",
    "year": "2016",
    "description": "A vulnerability was found in 3breadt dd-plist 1.17 and classified as problematic. Affected by this issue is some unknown functionality. The manipulation leads to xml external entity reference. An attack has to be approached locally. Upgrading to version 1.18 is able to address this issue. The patch is identified as 8c954e8d9f6f6863729e50105a8abf3f87fff74c. It is recommended to upgrade the affected component. VDB-221486 is the identifier assigned to this vulnerability.",
    "severity": "HIGH",
    "url": "https://github.com/3breadt/dd-plist/commit/8c954e8d9f6f6863729e50105a8abf3f87fff74c"
  },
  {
    "cve": "CVE-2016-15027",
    "year": "2016",
    "description": "A vulnerability was found in meta4creations Post Duplicator Plugin 2.18 on WordPress. It has been classified as problematic. Affected is the function mtphr_post_duplicator_notice of the file includes/notices.php. The manipulation of the argument post-duplicated leads to cross site scripting. It is possible to launch the attack remotely. Upgrading to version 2.19 is able to address this issue. The name of the patch is ca67c05e490c0cf93a1e9b2d93bfeff3dd96f594. It is recommended to upgrade the affected component. The identifier of this vulnerability is VDB-221496.",
    "severity": "MEDIUM",
    "url": "https://github.com/meta4creations/post-duplicator/commit/ca67c05e490c0cf93a1e9b2d93bfeff3dd96f594"
  },
  {
    "cve": "CVE-2016-15028",
    "year": "2016",
    "description": "A vulnerability was found in ICEPAY REST-API-NET 0.9. It has been declared as problematic. Affected by this vulnerability is the function RestClient of the file Classes/RestClient.cs of the component Checksum Validation. The manipulation leads to improper validation of integrity check value. The attack can be launched remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. Upgrading to version 1.0 is able to address this issue. The patch is named 61f6b8758e5c971abff5f901cfa9f231052b775f. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-222847.",
    "severity": "MEDIUM",
    "url": "https://github.com/ICEPAY/REST-API-NET/commit/61f6b8758e5c971abff5f901cfa9f231052b775f"
  },
  {
    "cve": "CVE-2016-15029",
    "year": "2016",
    "description": "A vulnerability has been found in Ydalb mapicoin up to 1.9.0 and classified as problematic. This vulnerability affects unknown code of the file webroot/stats.php. The manipulation of the argument link/search leads to cross site scripting. The attack can be initiated remotely. Upgrading to version 1.10.0 is able to address this issue. The patch is identified as 67e87f0f0c1ac238fcd050f4c3db298229bc9679. It is recommended to upgrade the affected component. VDB-223402 is the identifier assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/Ydalb/mapicoin/commit/67e87f0f0c1ac238fcd050f4c3db298229bc9679"
  },
  {
    "cve": "CVE-2016-15030",
    "year": "2016",
    "description": "A vulnerability classified as problematic has been found in Arno0x TwoFactorAuth. This affects an unknown part of the file login/login.php. The manipulation of the argument from leads to open redirect. It is possible to initiate the attack remotely. This product does not use versioning. This is why information about affected and unaffected releases are unavailable. The patch is named 8549ad3cf197095f783643e41333586d6a4d0e54. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-223803.",
    "severity": "MEDIUM",
    "url": "https://github.com/Arno0x/TwoFactorAuth/commit/8549ad3cf197095f783643e41333586d6a4d0e54"
  },
  {
    "cve": "CVE-2016-15031",
    "year": "2016",
    "description": "A vulnerability was found in PHP-Login 1.0. It has been declared as critical. This vulnerability affects the function checkLogin of the file login/scripts/class.loginscript.php of the component POST Parameter Handler. The manipulation of the argument myusername leads to sql injection. The attack can be initiated remotely. Upgrading to version 2.0 is able to address this issue. The patch is identified as 0083ec652786ddbb81335ea20da590df40035679. It is recommended to upgrade the affected component. VDB-228022 is the identifier assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/ipoelnet/php-login/commit/0083ec652786ddbb81335ea20da590df40035679"
  },
  {
    "cve": "CVE-2016-15032",
    "year": "2016",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability classified as problematic has been found in mback2k mh_httpbl Extension up to 1.1.7 on TYPO3. This affects the function stopOutput of the file class.tx_mhhttpbl.php. The manipulation of the argument $_SERVER['REMOTE_ADDR'] leads to cross site scripting. It is possible to initiate the attack remotely. Upgrading to version 1.1.8 is able to address this issue. The patch is named a754bf306a433a8c18b55e25595593e8f19b9463. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-230391. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "severity": "MEDIUM",
    "url": "https://github.com/mback2k/mh_httpbl/commit/a754bf306a433a8c18b55e25595593e8f19b9463"
  },
  {
    "cve": "CVE-2016-15033",
    "year": "2016",
    "description": "The Delete All Comments plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the via the delete-all-comments.php file in versions up to, and including, 2.0. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected sites server which may make remote code execution possible.",
    "severity": "CRITICAL",
    "url": "http://blog.nintechnet.com/arbitrary-file-upload-vulnerability-in-wordpress-delete-all-comments-plugin/"
  },
  {
    "cve": "CVE-2016-15034",
    "year": "2016",
    "description": "A vulnerability was found in Dynacase Webdesk and classified as critical. Affected by this issue is the function freedomrss_search of the file freedomrss_search.php. The manipulation leads to sql injection. Upgrading to version 3.2-20180305 is able to address this issue. The patch is identified as 750a9b35af182950c952faf6ddfdcc50a2b25f8b. It is recommended to upgrade the affected component. VDB-233366 is the identifier assigned to this vulnerability.",
    "severity": "CRITICAL",
    "url": "https://github.com/dynacase-labs/dynacase-webdesk/commit/750a9b35af182950c952faf6ddfdcc50a2b25f8b"
  },
  {
    "cve": "CVE-2016-15035",
    "year": "2016",
    "description": "A vulnerability was found in Doc2k RE-Chat 1.0. It has been classified as problematic. This affects an unknown part of the file js_on_radio-emergency.de_/re_chat.js. The manipulation leads to cross site scripting. It is possible to initiate the attack remotely. The patch is named bd17d497ddd3bab4ef9c6831c747c37cc016c570. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-238155.",
    "severity": "MEDIUM",
    "url": "https://github.com/Doc2k/re-chat/commit/bd17d497ddd3bab4ef9c6831c747c37cc016c570"
  },
  {
    "cve": "CVE-2016-15036",
    "year": "2016",
    "description": "** UNSUPPORTED WHEN ASSIGNED ** A vulnerability was found in Deis Workflow Manager up to 2.3.2. It has been classified as problematic. This affects an unknown part. The manipulation leads to race condition. The complexity of an attack is rather high. The exploitability is told to be difficult. Upgrading to version 2.3.3 is able to address this issue. The patch is named 31fe3bccbdde134a185752e53380330d16053f7f. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-248847. NOTE: This vulnerability only affects products that are no longer supported by the maintainer.",
    "severity": "HIGH",
    "url": "https://github.com/deis/workflow-manager/commit/31fe3bccbdde134a185752e53380330d16053f7f"
  },
  {
    "cve": "CVE-2016-15037",
    "year": "2016",
    "description": "A vulnerability, which was classified as problematic, has been found in go4rayyan Scumblr up to 2.0.1a. Affected by this issue is some unknown functionality of the component Task Handler. The manipulation leads to cross site scripting. The attack may be launched remotely. Upgrading to version 2.0.2 is able to address this issue. The patch is identified as 5c9120f2362ddb7cbe48f2c4620715adddc4ee35. It is recommended to upgrade the affected component. VDB-251570 is the identifier assigned to this vulnerability.",
    "severity": "MEDIUM",
    "url": "https://github.com/go4rayyan/CG1/commit/5c9120f2362ddb7cbe48f2c4620715adddc4ee35"
  },
  {
    "cve": "CVE-2016-15038",
    "year": "2016",
    "description": "A vulnerability, which was classified as critical, was found in NUUO NVRmini 2 up to 3.0.8. Affected is an unknown function of the file /deletefile.php. The manipulation of the argument filename leads to path traversal. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-258780.",
    "severity": "N/A",
    "url": "https://vuldb.com/?ctiid.258780"
  },
  {
    "cve": "CVE-2016-15039",
    "year": "2016",
    "description": "A vulnerability classified as critical was found in mhuertos phpLDAPadmin up to 665dbc2690ebeb5392d38f1fece0a654225a0b38. Affected by this vulnerability is the function makeHttpRequest of the file htdocs/js/ajax_functions.js. The manipulation leads to http request smuggling. The attack can be launched remotely. This product does not use versioning. This is why information about affected and unaffected releases are unavailable. The patch is named dd6e9583a2eb2ca085583765e8a63df5904cb036. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-270523.",
    "severity": "N/A",
    "url": "https://github.com/mhuertos/phpLDAPadmin/commit/dd6e9583a2eb2ca085583765e8a63df5904cb036"
  },
  {
    "cve": "CVE-2016-15040",
    "year": "2016",
    "description": "The Kento Post View Counter plugin for WordPress is vulnerable to SQL Injection via the 'kento_pvc_geo' parameter in versions up to, and including, 2.8 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database.",
    "severity": "N/A",
    "url": "https://plugins.trac.wordpress.org/browser/kento-post-view-counter/trunk/index.php#L216"
  },
  {
    "cve": "CVE-2016-15041",
    "year": "2016",
    "description": "The MainWP Dashboard – The Private WordPress Manager for Multiple Website Maintenance plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the ‘mwp_setup_purchase_username’ parameter in versions up to, and including, 3.1.2 due to insufficient input sanitization and output escaping. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page.",
    "severity": "HIGH",
    "url": "https://www.wordfence.com/threat-intel/vulnerabilities/id/a9b1445f-3b6b-40fa-9a12-f55d63668dda?source=cve"
  },
  {
    "cve": "CVE-2016-15042",
    "year": "2016",
    "description": "The Frontend File Manager (versions < 4.0), N-Media Post Front-end Form (versions < 1.1) plugins for WordPress are vulnerable to arbitrary file uploads due to missing file type validation via the `nm_filemanager_upload_file` and `nm_postfront_upload_file` AJAX actions. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected sites server which may make remote code execution possible.",
    "severity": "CRITICAL",
    "url": "https://wordpress.org/plugins/nmedia-user-file-uploader/#developers"
  },
  {
    "cve": "CVE-2016-1579",
    "year": "2016",
    "description": "UDM provides support for running commands after a download is completed, this is currently made use of for click package installation. This functionality was not restricted to unconfined applications. Before UDM version 1.2+16.04.20160408-0ubuntu1 any confined application could make use of the UDM C++ API to run arbitrary commands in an unconfined environment as the phablet user.",
    "severity": "CRITICAL",
    "url": "https://bazaar.launchpad.net/~phablet-team/ubuntu-download-manager/trunk/revision/359"
  },
  {
    "cve": "CVE-2016-1600",
    "year": "2016",
    "description": "The ServiceNow driver in NetIQ Identity Manager versions prior to 4.6 are susceptible to an information disclosure vulnerability.",
    "severity": "HIGH",
    "url": "https://www.netiq.com/documentation/identity-manager-46/releasenotes_idm46/data/releasenotes_idm46.html#t433o7au0niu"
  },
  {
    "cve": "CVE-2016-20010",
    "year": "2016",
    "description": "EWWW Image Optimizer before 2.8.5 allows remote command execution because it relies on a protection mechanism involving boolval, which is unavailable before PHP 5.5.",
    "severity": "CRITICAL",
    "url": "https://plugins.trac.wordpress.org/browser/ewww-image-optimizer/trunk/changelog.txt"
  },
  {
    "cve": "CVE-2016-20016",
    "year": "2016",
    "description": "MVPower CCTV DVR models, including TV-7104HE 1.8.4 115215B9 and TV7108HE, contain a web shell that is accessible via a /shell URI. A remote unauthenticated attacker can execute arbitrary operating system commands as root. This vulnerability has also been referred to as the \"JAWS webserver RCE\" because of the easily identifying HTTP response server field. Other firmware versions, at least from 2014 through 2019, can be affected. This was exploited in the wild in 2017 through 2022.",
    "severity": "CRITICAL",
    "url": "https://blog.netlab.360.com/iot_reaper-a-rappid-spreading-new-iot-botnet-en/"
  },
  {
    "cve": "CVE-2016-20021",
    "year": "2016",
    "description": "In Gentoo Portage before 3.0.47, there is missing PGP validation of executed code: the standalone emerge-webrsync downloads a .gpgsig file but does not perform signature verification. Unless emerge-webrsync is used, Portage is not vulnerable.",
    "severity": "CRITICAL",
    "url": "https://bugs.gentoo.org/597800"
  },
  {
    "cve": "CVE-2016-2123",
    "year": "2016",
    "description": "A flaw was found in samba versions 4.0.0 to 4.5.2. The Samba routine ndr_pull_dnsp_name contains an integer wrap problem, leading to an attacker-controlled memory overwrite. ndr_pull_dnsp_name parses data from the Samba Active Directory ldb database. Any user who can write to the dnsRecord attribute over LDAP can trigger this memory corruption. By default, all authenticated LDAP users can write to the dnsRecord attribute on new DNS objects. This makes the defect a remote privilege escalation.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94970"
  },
  {
    "cve": "CVE-2016-2125",
    "year": "2016",
    "description": "It was found that Samba before versions 4.5.3, 4.4.8, 4.3.13 always requested forwardable tickets when using Kerberos authentication. A service to which Samba authenticated using Kerberos could subsequently use the ticket to impersonate Samba to other services or domain users.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0494.html"
  },
  {
    "cve": "CVE-2016-2338",
    "year": "2016",
    "description": "An exploitable heap overflow vulnerability exists in the Psych::Emitter start_document function of Ruby. In Psych::Emitter start_document function heap buffer \"head\" allocation is made based on tags array length. Specially constructed object passed as element of tags array can increase this array size after mentioned allocation and cause heap overflow.",
    "severity": "CRITICAL",
    "url": "http://www.talosintelligence.com/reports/TALOS-2016-0032/"
  },
  {
    "cve": "CVE-2016-2358",
    "year": "2016",
    "description": "Milesight IP security cameras through 2016-11-14 have a default set of 10 privileged accounts with hardcoded credentials. They are accessible if the customer has not configured 10 actual user accounts.",
    "severity": "CRITICAL",
    "url": "http://kirils.org/slides/2016-10-06_Milesight_initial.pdf"
  },
  {
    "cve": "CVE-2016-3192",
    "year": "2016",
    "description": "Cloudera Manager 5.x before 5.7.1 places Sensitive Data in cleartext Readable Files.",
    "severity": "MEDIUM",
    "url": "https://docs.cloudera.com/documentation/other/security-bulletins/topics/Security-Bulletin.html#tsb_134"
  },
  {
    "cve": "CVE-2016-3709",
    "year": "2016",
    "description": "Possible cross-site scripting vulnerability in libxml after commit 960f0e2.",
    "severity": "MEDIUM",
    "url": "https://mail.gnome.org/archives/xml/2018-January/msg00010.html"
  },
  {
    "cve": "CVE-2016-3735",
    "year": "2016",
    "description": "Piwigo is image gallery software written in PHP. When a criteria is not met on a host, piwigo defaults to usingmt_rand in order to generate password reset tokens. mt_rand output can be predicted after recovering the seed used to generate it. This low an unauthenticated attacker to take over an account providing they know an administrators email address in order to be able to request password reset.",
    "severity": "HIGH",
    "url": "http://piwigo.org/release-2.8.1%2C"
  },
  {
    "cve": "CVE-2016-3952",
    "year": "2016",
    "description": "web2py before 2.14.1, when using the standalone version, allows remote attackers to obtain environment variable values via a direct request to examples/template_examples/beautify.  NOTE: this issue can be leveraged by remote attackers to gain administrative access.",
    "severity": "HIGH",
    "url": "https://devco.re/blog/2017/01/03/web2py-unserialize-code-execution-CVE-2016-3957/"
  },
  {
    "cve": "CVE-2016-4426",
    "year": "2016",
    "description": "In zulip before 1.3.12, bot API keys were accessible to other users in the same realm.",
    "severity": "MEDIUM",
    "url": "https://zulip.readthedocs.io/en/2.1.7/overview/changelog.html#id35"
  },
  {
    "cve": "CVE-2016-4427",
    "year": "2016",
    "description": "In zulip before 1.3.12, deactivated users could access messages if SSO was enabled.",
    "severity": "HIGH",
    "url": "https://zulip.readthedocs.io/en/2.1.7/overview/changelog.html#id35"
  },
  {
    "cve": "CVE-2016-4975",
    "year": "2016",
    "description": "Possible CRLF injection allowing HTTP response splitting attacks for sites which use mod_userdir. This issue was mitigated by changes made in 2.4.25 and 2.2.32 which prohibit CR or LF injection into the \"Location\" or other outbound header key or value. Fixed in Apache HTTP Server 2.4.25 (Affected 2.4.1-2.4.23). Fixed in Apache HTTP Server 2.2.32 (Affected 2.2.0-2.2.31).",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/105093"
  },
  {
    "cve": "CVE-2016-4991",
    "year": "2016",
    "description": "Input passed to the Pdf() function is shell escaped and passed to child_process.exec() during PDF rendering. However, the shell escape does not properly encode all special characters, namely, semicolon and curly braces. This can be abused to achieve command execution. This problem affects nodepdf 1.3.0.",
    "severity": "CRITICAL",
    "url": "https://lf.lc/cve/cve-2016-4991/"
  },
  {
    "cve": "CVE-2016-5287",
    "year": "2016",
    "description": "A potentially exploitable use-after-free crash during actor destruction with service workers. This issue does not affect releases earlier than Firefox 49. This vulnerability affects Firefox < 49.0.2.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/93811"
  },
  {
    "cve": "CVE-2016-5288",
    "year": "2016",
    "description": "Web content could access information in the HTTP cache if e10s is disabled. This can reveal some visited URLs and the contents of those pages. This issue affects Firefox 48 and 49. This vulnerability affects Firefox < 49.0.2.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/93810"
  },
  {
    "cve": "CVE-2016-5292",
    "year": "2016",
    "description": "During URL parsing, a maliciously crafted URL can cause a potentially exploitable crash. This vulnerability affects Firefox < 50.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-5296",
    "year": "2016",
    "description": "A heap-buffer-overflow in Cairo when processing SVG content caused by compiler optimization, resulting in a potentially exploitable crash. This vulnerability affects Thunderbird < 45.5, Firefox ESR < 45.5, and Firefox < 50.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2780.html"
  },
  {
    "cve": "CVE-2016-5431",
    "year": "2016",
    "description": "The PHP JOSE Library by Gree Inc. before version 2.2.1 is vulnerable to key confusion/algorithm substitution in the JWS component resulting in bypassing the signature verification via crafted tokens.",
    "severity": "HIGH",
    "url": "https://github.com/nov/jose-php/commit/1cce55e27adf0274193eb1cd74b927a398a3df4b"
  },
  {
    "cve": "CVE-2016-6343",
    "year": "2016",
    "description": "JBoss BPM Suite 6 is vulnerable to a reflected XSS via dashbuilder. Remote attackers can entice authenticated users that have privileges to access dashbuilder (usually admins) to click on links to /dashbuilder/Controller containing malicious scripts. Successful exploitation would allow execution of script code within the context of the affected user.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0557.html"
  },
  {
    "cve": "CVE-2016-6539",
    "year": "2016",
    "description": "The Trackr device ID is constructed of a manufacturer identifier of four zeroes followed by the BLE MAC address in reverse. The MAC address can be obtained by being in close proximity to the Bluetooth device, effectively exposing the device ID. The ID can be used to track devices. Updated apps, version 5.1.6 for iOS and 2.2.5 for Android, have been released by the vendor to address the vulnerabilities in CVE-2016-6538, CVE-2016-6539, CVE-2016-6540 and CVE-2016-6541.",
    "severity": "LOW",
    "url": "http://www.securityfocus.com/bid/93874"
  },
  {
    "cve": "CVE-2016-6541",
    "year": "2016",
    "description": "TrackR Bravo device allows unauthenticated pairing, which enables unauthenticated connected applications to write to various device attributes. Updated apps, version 5.1.6 for iOS and 2.2.5 for Android, have been released by the vendor to address the vulnerabilities in CVE-2016-6538, CVE-2016-6539, CVE-2016-6540 and CVE-2016-6541.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/93874"
  },
  {
    "cve": "CVE-2016-6542",
    "year": "2016",
    "description": "The iTrack device tracking ID number, also called \"LosserID\" in the web API, can be obtained by being in the range of an iTrack device. The tracker ID is the device's BLE MAC address.",
    "severity": "LOW",
    "url": "http://www.securityfocus.com/bid/93875"
  },
  {
    "cve": "CVE-2016-6549",
    "year": "2016",
    "description": "The Zizai Tech Nut device allows unauthenticated Bluetooth pairing, which enables unauthenticated connected applications to write data to the device name attribute.",
    "severity": "MEDIUM",
    "url": "https://blog.rapid7.com/2016/10/25/multiple-bluetooth-low-energy-ble-tracker-vulnerabilities/"
  },
  {
    "cve": "CVE-2016-6551",
    "year": "2016",
    "description": "Intellian Satellite TV antennas t-Series and v-Series, firmware version 1.07, uses non-random default credentials of: ftp/ftp or intellian:12345678. A remote network attacker can gain elevated access to a vulnerable device.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/93808"
  },
  {
    "cve": "CVE-2016-6552",
    "year": "2016",
    "description": "Green Packet DX-350 uses non-random default credentials of: root:wimax. A remote network attacker can gain privileged access to a vulnerable device.",
    "severity": "CRITICAL",
    "url": "https://www.kb.cert.org/vuls/id/970379"
  },
  {
    "cve": "CVE-2016-6553",
    "year": "2016",
    "description": "Nuuo NT-4040 Titan, firmware NT-4040_01.07.0000.0015_1120, uses non-random default credentials of: admin:admin and localdisplay:111111. A remote network attacker can gain privileged access to a vulnerable device.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/93807"
  },
  {
    "cve": "CVE-2016-6554",
    "year": "2016",
    "description": "Synology NAS servers DS107, firmware version 3.1-1639 and prior, and DS116, DS213, firmware versions prior to 5.2-5644-1, use non-random default credentials of: guest:(blank) and admin:(blank) . A remote network attacker can gain privileged access to a vulnerable device.",
    "severity": "CRITICAL",
    "url": "https://www.kb.cert.org/vuls/id/404187"
  },
  {
    "cve": "CVE-2016-6555",
    "year": "2016",
    "description": "OpenNMS version 18.0.1 and prior are vulnerable to a stored XSS issue due to insufficient filtering of SNMP trap supplied data. By creating a malicious SNMP trap, an attacker can store an XSS payload which will trigger when a user of the web UI views the events list page. This issue was fixed in version 18.0.2, released on September 20, 2016.",
    "severity": "MEDIUM",
    "url": "https://github.com/OpenNMS/opennms/pull/1019"
  },
  {
    "cve": "CVE-2016-6556",
    "year": "2016",
    "description": "OpenNMS version 18.0.1 and prior are vulnerable to a stored XSS issue due to insufficient filtering of SNMP agent supplied data. By creating a malicious SNMP 'sysName' or 'sysContact' response, an attacker can store an XSS payload which will trigger when a user of the web UI views the data. This issue was fixed in version 18.0.2, released on September 20, 2016.",
    "severity": "MEDIUM",
    "url": "https://github.com/OpenNMS/opennms/pull/1019"
  },
  {
    "cve": "CVE-2016-6559",
    "year": "2016",
    "description": "Improper bounds checking of the obuf variable in the link_ntoa() function in linkaddr.c of the BSD libc library may allow an attacker to read or write from memory. The full impact and severity depends on the method of exploit and how the library is used by applications. According to analysis by FreeBSD developers, it is very unlikely that applications exist that utilize link_ntoa() in an exploitable manner, and the CERT/CC is not aware of any proof of concept. A blog post describes the functionality of link_ntoa() and points out that none of the base utilities use this function in an exploitable manner. For more information, please see FreeBSD Security Advisory SA-16:37.",
    "severity": "CRITICAL",
    "url": "http://www.securitytracker.com/id/1037398"
  },
  {
    "cve": "CVE-2016-6562",
    "year": "2016",
    "description": "On iOS and Android devices, the ShoreTel Mobility Client app version 9.1.3.109 fails to properly validate SSL certificates provided by HTTPS connections, which means that an attacker in the position to perform MITM attacks may be able to obtain sensitive account information such as login credentials.",
    "severity": "HIGH",
    "url": "https://www.info-sec.ca/advisories/ShoreTel-Mobility.html"
  },
  {
    "cve": "CVE-2016-6563",
    "year": "2016",
    "description": "Processing malformed SOAP messages when performing the HNAP Login action causes a buffer overflow in the stack in some D-Link DIR routers. The vulnerable XML fields within the SOAP body are: Action, Username, LoginPassword, and Captcha. The following products are affected: DIR-823, DIR-822, DIR-818L(W), DIR-895L, DIR-890L, DIR-885L, DIR-880L, DIR-868L, and DIR-850L.",
    "severity": "CRITICAL",
    "url": "http://seclists.org/fulldisclosure/2016/Nov/38"
  },
  {
    "cve": "CVE-2016-6566",
    "year": "2016",
    "description": "The valueAsString parameter inside the JSON payload contained by the ucLogin_txtLoginId_ClientStat POST parameter of the Sungard eTRAKiT3 software version 3.2.1.17 is not properly validated. An unauthenticated remote attacker may be able to modify the POST request and insert a SQL query which may then be executed by the backend server. eTRAKiT 3.2.1.17 was tested, but other versions may also be vulnerable.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/94696"
  },
  {
    "cve": "CVE-2016-6567",
    "year": "2016",
    "description": "SHDesigns' Resident Download Manager provides firmware update capabilities for Rabbit 2000/3000 CPU boards, which according to the reporter may be used in some industrial control and embedded applications. The Resident Download Manager does not verify that the firmware is authentic before executing code and deploying the firmware to devices. A remote attacker with the ability to send UDP traffic to the device may be able to execute arbitrary code on the device. According to SHDesigns' website, the Resident Download Manager and other Rabbit Tools have been discontinued since June 2011.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/95898"
  },
  {
    "cve": "CVE-2016-6591",
    "year": "2016",
    "description": "A security bypass vulnerability exists in Symantec Norton App Lock 1.0.3.186 and earlier if application pinning is enabled, which could let a local malicious user bypass security restrictions.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94343"
  },
  {
    "cve": "CVE-2016-6599",
    "year": "2016",
    "description": "BMC Track-It! 11.4 before Hotfix 3 exposes an unauthenticated .NET remoting configuration service (ConfigurationService) on port 9010. This service contains a method that can be used to retrieve a configuration file that contains the application database name, username and password as well as the domain administrator username and password. These are encrypted with a fixed key and IV (\"NumaraIT\") using the DES algorithm. The domain administrator username and password can only be obtained if the Self-Service component is enabled, which is the most common scenario in enterprise deployments.",
    "severity": "CRITICAL",
    "url": "http://packetstormsecurity.com/files/146110/BMC-Track-It-11.4-Code-Execution-Information-Disclosure.html"
  },
  {
    "cve": "CVE-2016-6813",
    "year": "2016",
    "description": "Apache CloudStack 4.1 to 4.8.1.0 and 4.9.0.0 contain an API call designed to allow a user to register for the developer API. If a malicious user is able to determine the ID of another (non-\"root\") CloudStack user, the malicious user may be able to reset the API keys for the other user, in turn accessing their account and resources.",
    "severity": "CRITICAL",
    "url": "http://mail-archives.apache.org/mod_mbox/www-announce/201610.mbox/%3CCAJtfqCupOYQoNY2BNx86_zauses_MpmpiX8WciO_DEaWp6uNig%40mail.gmail.com%3E"
  },
  {
    "cve": "CVE-2016-6814",
    "year": "2016",
    "description": "When an application with unsupported Codehaus versions of Groovy from 1.7.0 to 2.4.3, Apache Groovy 2.4.4 to 2.4.7 on classpath uses standard Java serialization mechanisms, e.g. to communicate between servers or to store local data, it was possible for an attacker to bake a special serialized object that will execute code directly when deserialized. All applications which rely on serialization and do not isolate the code which deserializes objects were subject to this vulnerability.",
    "severity": "CRITICAL",
    "url": "http://mail-archives.apache.org/mod_mbox/www-announce/201701.mbox/%3CCADRx3PMZ2hBCGDTY35zYXFGaDnjAs0tc5-upaVs6QN2sYUejyA%40mail.gmail.com%3E"
  },
  {
    "cve": "CVE-2016-7061",
    "year": "2016",
    "description": "An information disclosure vulnerability was found in JBoss Enterprise Application Platform before 7.0.4. It was discovered that when configuring RBAC and marking information as sensitive, users with a Monitor role are able to view the sensitive information.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0170.html"
  },
  {
    "cve": "CVE-2016-7067",
    "year": "2016",
    "description": "Monit before version 5.20.0 is vulnerable to a cross site request forgery attack. Successful exploitation will enable an attacker to disable/enable all monitoring for a particular host or disable/enable monitoring for a specific service.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/93953"
  },
  {
    "cve": "CVE-2016-7070",
    "year": "2016",
    "description": "A privilege escalation flaw was found in the Ansible Tower. When Tower before 3.0.3 deploys a PostgreSQL database, it incorrectly configures the trust level of postgres user. An attacker could use this vulnerability to gain admin level access to the database.",
    "severity": "HIGH",
    "url": "https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2016-7070"
  },
  {
    "cve": "CVE-2016-7072",
    "year": "2016",
    "description": "An issue has been found in PowerDNS Authoritative Server before 3.4.11 and 4.0.2 allowing a remote, unauthenticated attacker to cause a denial of service by opening a large number of TCP connections to the web server. If the web server runs out of file descriptors, it triggers an exception and terminates the whole PowerDNS process. While it's more complicated for an unauthorized attacker to make the web server run out of file descriptors since its connection will be closed just after being accepted, it might still be possible.",
    "severity": "HIGH",
    "url": "https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2016-7072"
  },
  {
    "cve": "CVE-2016-7073",
    "year": "2016",
    "description": "An issue has been found in PowerDNS before 3.4.11 and 4.0.2, and PowerDNS recursor before 4.0.4, allowing an attacker in position of man-in-the-middle to alter the content of an AXFR because of insufficient validation of TSIG signatures. A missing check of the TSIG time and fudge values was found in AXFRRetriever, leading to a possible replay attack.",
    "severity": "MEDIUM",
    "url": "https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2016-7073"
  },
  {
    "cve": "CVE-2016-7076",
    "year": "2016",
    "description": "sudo before version 1.8.18p1 is vulnerable to a bypass in the sudo noexec restriction if application run via sudo executed wordexp() C library function with a user supplied argument. A local user permitted to run such application via sudo with noexec restriction could possibly use this flaw to execute arbitrary commands with elevated privileges.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2872.html"
  },
  {
    "cve": "CVE-2016-7077",
    "year": "2016",
    "description": "foreman before 1.14.0 is vulnerable to an information leak. It was found that Foreman form helper does not authorize options for associated objects. Unauthorized user can see names of such objects if their count is less than 6.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94230"
  },
  {
    "cve": "CVE-2016-7078",
    "year": "2016",
    "description": "foreman before version 1.15.0 is vulnerable to an information leak through organizations and locations feature. When a user is assigned _no_ organizations/locations, they are able to view all resources instead of none (mirroring an administrator's view). The user's actions are still limited by their assigned permissions, e.g. to control viewing, editing and deletion.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/96385"
  },
  {
    "cve": "CVE-2016-7293",
    "year": "2016",
    "description": "Rejected reason: DO NOT USE THIS CANDIDATE NUMBER.  ConsultIDs: none.  Reason: This candidate was withdrawn by its CNA.  Further investigation showed that it was not a security issue in a \"generally available\" software product.  Notes: none",
    "severity": "N/A",
    "url": ""
  },
  {
    "cve": "CVE-2016-8371",
    "year": "2016",
    "description": "The web server in Phoenix Contact ILC PLCs can be accessed without authenticating even if the authentication mechanism is enabled.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94163"
  },
  {
    "cve": "CVE-2016-8380",
    "year": "2016",
    "description": "The web server in Phoenix Contact ILC PLCs allows access to read and write PLC variables without authentication.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94163"
  },
  {
    "cve": "CVE-2016-8382",
    "year": "2016",
    "description": "An exploitable heap corruption vulnerability exists in the Doc_SetSummary functionality of AntennaHouse DMC HTMLFilter. A specially crafted doc file can cause a heap corruption resulting in arbitrary code execution. An attacker can send a malicious doc file to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "https://www.talosintelligence.com/vulnerability_reports/TALOS-2016-0207"
  },
  {
    "cve": "CVE-2016-8383",
    "year": "2016",
    "description": "An exploitable heap corruption vulnerability exists in the Doc_GetFontTable functionality of AntennaHouse DMC HTMLFilter. A specially crafted doc file can cause a heap corruption resulting in arbitrary code execution. An attacker can send/provide malicious doc file to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "https://www.talosintelligence.com/vulnerability_reports/TALOS-2016-0208"
  },
  {
    "cve": "CVE-2016-8384",
    "year": "2016",
    "description": "An exploitable heap corruption vulnerability exists in the DHFSummary functionality of AntennaHouse DMC HTMLFilter.",
    "severity": "HIGH",
    "url": "https://www.talosintelligence.com/vulnerability_reports/TALOS-2016-0209"
  },
  {
    "cve": "CVE-2016-8390",
    "year": "2016",
    "description": "An exploitable out of bounds write vulnerability exists in the parsing of ELF Section Headers of Hopper Disassembler 3.11.20. A specially crafted ELF file can cause attacker controlled pointer arithmetic resulting in a partially controlled out of bounds write. An attacker can craft an ELF file with specific section headers to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/93801"
  },
  {
    "cve": "CVE-2016-8513",
    "year": "2016",
    "description": "A Cross-Site Request Forgery (CSRF) vulnerability in HPE Version Control Repository Manager (VCRM) was found. The problem impacts all versions prior to 7.6.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94949"
  },
  {
    "cve": "CVE-2016-8514",
    "year": "2016",
    "description": "A remote information disclosure in HPE Version Control Repository Manager (VCRM) was found. The problem impacts all versions prior to 7.6.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94949"
  },
  {
    "cve": "CVE-2016-8515",
    "year": "2016",
    "description": "A remote malicious file upload vulnerability in HPE Version Control Repository Manager (VCRM) was found. The problem impacts all versions prior to 7.6.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94949"
  },
  {
    "cve": "CVE-2016-8525",
    "year": "2016",
    "description": "A Remote Disclosure of Information vulnerability in HPE iMC PLAT version v7.2 E0403P06 and earlier was found. The problem was resolved in iMC PLAT 7.3 E0504 or subsequent version.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/95912"
  },
  {
    "cve": "CVE-2016-8526",
    "year": "2016",
    "description": "Aruba Airwave all versions up to, but not including, 8.2.3.1 is vulnerable to an XML external entities (XXE). XXEs are a way to permit XML parsers to access storage that exist on external systems. If an unprivileged user is permitted to control the contents of XML files, XXE can be used as an attack vector. Because the XML parser has access to the local filesystem and runs with the permissions of the web server, it can access any file that is readable by the web server and copy it to an external system of the attacker's choosing. This could include files that contain passwords, which could then lead to privilege escalation.",
    "severity": "HIGH",
    "url": "http://www.arubanetworks.com/assets/alert/ARUBA-PSA-2017-001.txt"
  },
  {
    "cve": "CVE-2016-8527",
    "year": "2016",
    "description": "Aruba Airwave all versions up to, but not including, 8.2.3.1 is vulnerable to a reflected cross-site scripting (XSS). The vulnerability is present in the VisualRF component of AirWave. By exploiting this vulnerability, an attacker who can trick a logged-in AirWave administrative user into clicking a link could obtain sensitive information, such as session cookies or passwords. The vulnerability requires that an administrative users click on the malicious link while currently logged into AirWave in the same browser.",
    "severity": "MEDIUM",
    "url": "http://www.arubanetworks.com/assets/alert/ARUBA-PSA-2017-001.txt"
  },
  {
    "cve": "CVE-2016-8529",
    "year": "2016",
    "description": "A Remote Arbitrary Command Execution vulnerability in HPE StoreVirtual 4000 Storage and StoreVirtual VSA Software running LeftHand OS version v12.5 and earlier was found. The problem was resolved in LeftHand OS v12.6 or any subsequent version.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/95970"
  },
  {
    "cve": "CVE-2016-8530",
    "year": "2016",
    "description": "A remote denial of service vulnerability in HPE iMC PLAT version v7.2 E0403P06 and earlier was found. The problem was resolved in iMC PLAT 7.3 E0504 or subsequent version.",
    "severity": "HIGH",
    "url": "https://support.hpe.com/hpsc/doc/public/display?docId=emr_na-c05382418"
  },
  {
    "cve": "CVE-2016-8601",
    "year": "2016",
    "description": "Rejected reason: DO NOT USE THIS CANDIDATE NUMBER.  ConsultIDs: none.  Reason: This candidate was withdrawn by its CNA.  Further investigation showed that it was not a security issue in a \"generally available\" software product.  Notes: none",
    "severity": "N/A",
    "url": ""
  },
  {
    "cve": "CVE-2016-8608",
    "year": "2016",
    "description": "JBoss BRMS 6 and BPM Suite 6 are vulnerable to a stored XSS via business process editor. The flaw is due to an incomplete fix for CVE-2016-5398. Remote, authenticated attackers that have privileges to create business processes can store scripts in them, which are not properly sanitized before showing to other users, including admins.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2822.html"
  },
  {
    "cve": "CVE-2016-8609",
    "year": "2016",
    "description": "It was found that the keycloak before 2.3.0 did not implement authentication flow correctly. An attacker could use this flaw to construct a phishing URL, from which he could hijack the user's session. This could lead to information disclosure, or permit further possible attacks.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2945.html"
  },
  {
    "cve": "CVE-2016-8611",
    "year": "2016",
    "description": "A vulnerability was found in Openstack Glance. No limits are enforced within the Glance image service for both v1 and v2 `/images` API POST method for authenticated users, resulting in possible denial of service attacks through database table saturation.",
    "severity": "MEDIUM",
    "url": "http://seclists.org/oss-sec/2016/q4/266"
  },
  {
    "cve": "CVE-2016-8612",
    "year": "2016",
    "description": "Apache HTTP Server mod_cluster before version httpd 2.4.23 is vulnerable to an Improper Input Validation in the protocol parsing logic in the load balancer resulting in a Segmentation Fault in the serving httpd process.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2957.html"
  },
  {
    "cve": "CVE-2016-8614",
    "year": "2016",
    "description": "A flaw was found in Ansible before version 2.2.0. The apt_key module does not properly verify key fingerprints, allowing remote adversary to create an OpenPGP key which matches the short key ID and inject this key instead of the correct key.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94108"
  },
  {
    "cve": "CVE-2016-8618",
    "year": "2016",
    "description": "The libcurl API function called `curl_maprintf()` before version 7.51.0 can be tricked into doing a double-free due to an unsafe `size_t` multiplication, on systems using 32 bit `size_t` variables.",
    "severity": "CRITICAL",
    "url": "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html"
  },
  {
    "cve": "CVE-2016-8619",
    "year": "2016",
    "description": "The function `read_data()` in security.c in curl before version 7.51.0 is vulnerable to memory double free.",
    "severity": "CRITICAL",
    "url": "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html"
  },
  {
    "cve": "CVE-2016-8621",
    "year": "2016",
    "description": "The `curl_getdate` function in curl before version 7.51.0 is vulnerable to an out of bounds read if it receives an input with one digit short.",
    "severity": "HIGH",
    "url": "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html"
  },
  {
    "cve": "CVE-2016-8622",
    "year": "2016",
    "description": "The URL percent-encoding decode function in libcurl before 7.51.0 is called `curl_easy_unescape`. Internally, even if this function would be made to allocate a unscape destination buffer larger than 2GB, it would return that new length in a signed 32 bit integer variable, thus the length would get either just truncated or both truncated and turned negative. That could then lead to libcurl writing outside of its heap based buffer.",
    "severity": "CRITICAL",
    "url": "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html"
  },
  {
    "cve": "CVE-2016-8627",
    "year": "2016",
    "description": "admin-cli before versions 3.0.0.alpha25, 2.2.1.cr2 is vulnerable to an EAP feature to download server log files that allows logs to be available via GET requests making them vulnerable to cross-origin attacks. An attacker could trigger the user's browser to request the log files consuming enough resources that normal server functioning could be impaired.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0170.html"
  },
  {
    "cve": "CVE-2016-8628",
    "year": "2016",
    "description": "Ansible before version 2.2.0 fails to properly sanitize fact variables sent from the Ansible controller. An attacker with the ability to create special variables on the controller could execute arbitrary commands on Ansible clients as the user Ansible runs as.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/94109"
  },
  {
    "cve": "CVE-2016-8635",
    "year": "2016",
    "description": "It was found that Diffie Hellman Client key exchange handling in NSS 3.21.x was vulnerable to small subgroup confinement attack. An attacker could use this flaw to recover private keys by confining the client DH key to small subgroup of the desired group.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2779.html"
  },
  {
    "cve": "CVE-2016-8637",
    "year": "2016",
    "description": "A local information disclosure issue was found in dracut before 045 when generating initramfs images with world-readable permissions when 'early cpio' is used, such as when including microcode updates. Local attacker can use this to obtain sensitive information from these files, such as encryption keys or credentials.",
    "severity": "HIGH",
    "url": "http://seclists.org/oss-sec/2016/q4/352"
  },
  {
    "cve": "CVE-2016-8639",
    "year": "2016",
    "description": "It was found that foreman before 1.13.0 is vulnerable to a stored XSS via an organization or location name. This could allow an attacker with privileges to set the organization or location name to display arbitrary HTML including scripting code within the web interface.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94263"
  },
  {
    "cve": "CVE-2016-8640",
    "year": "2016",
    "description": "A SQL injection vulnerability in pycsw all versions before 2.0.2, 1.10.5 and 1.8.6 that leads to read and extract of any data from any table in the pycsw database that the database user has access to. Also on PostgreSQL (at least) it is possible to perform updates/inserts/deletes and database modifications to any table the database user has access to.",
    "severity": "CRITICAL",
    "url": "http://seclists.org/oss-sec/2016/q4/406"
  },
  {
    "cve": "CVE-2016-8641",
    "year": "2016",
    "description": "A privilege escalation vulnerability was found in nagios 4.2.x that occurs in daemon-init.in when creating necessary files and insecurely changing the ownership afterwards. It's possible for the local attacker to create symbolic links before the files are to be created and possibly escalating the privileges with the ownership change.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/95121"
  },
  {
    "cve": "CVE-2016-8647",
    "year": "2016",
    "description": "An input validation vulnerability was found in Ansible's mysql_user module before 2.2.1.0, which may fail to correctly change a password in certain circumstances. Thus the previous password would still be active when it should have been changed.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHSA-2017:1685"
  },
  {
    "cve": "CVE-2016-8656",
    "year": "2016",
    "description": "Jboss jbossas before versions 5.2.0-23, 6.4.13, 7.0.5 is vulnerable to an unsafe file handling in the jboss init script which could result in local privilege escalation.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0244.html"
  },
  {
    "cve": "CVE-2016-8657",
    "year": "2016",
    "description": "It was discovered that EAP packages in certain versions of Red Hat Enterprise Linux use incorrect permissions for /etc/sysconfig/jbossas configuration files. The file is writable to jboss group (root:jboss, 664). On systems using classic /etc/init.d init scripts (i.e. on Red Hat Enterprise Linux 6 and earlier), the file is sourced by the jboss init script and its content executed with root privileges when jboss service is started, stopped, or restarted.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0826.html"
  },
  {
    "cve": "CVE-2016-8717",
    "year": "2016",
    "description": "An exploitable Use of Hard-coded Credentials vulnerability exists in the Moxa AWK-3131A Wireless Access Point running firmware 1.1. The device operating system contains an undocumented, privileged (root) account with hard-coded credentials, giving attackers full control of affected devices.",
    "severity": "CRITICAL",
    "url": "https://www.talosintelligence.com/vulnerability_reports/TALOS-2016-0231"
  },
  {
    "cve": "CVE-2016-8728",
    "year": "2016",
    "description": "An exploitable heap out of bounds write vulnerability exists in the Fitz graphical library part of the MuPDF renderer. A specially crafted PDF file can cause a out of bounds write resulting in heap metadata and sensitive process memory corruption leading to potential code execution. Victim needs to open the specially crafted file in a vulnerable reader in order to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "http://www.ghostscript.com/cgi-bin/findgit.cgi?0c86abf954ca4a5f00c26f6600acac93f9fc3538"
  },
  {
    "cve": "CVE-2016-8729",
    "year": "2016",
    "description": "An exploitable memory corruption vulnerability exists in the JBIG2 parser of Artifex MuPDF 1.9. A specially crafted PDF can cause a negative number to be passed to a memset resulting in memory corruption and potential code execution. An attacker can specially craft a PDF and send to the victim to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "https://bugs.ghostscript.com/show_bug.cgi?id=697395"
  },
  {
    "cve": "CVE-2016-8742",
    "year": "2016",
    "description": "The Windows installer that the Apache CouchDB team provides was vulnerable to local privilege escalation. All files in the install inherit the file permissions of the parent directory and therefore a non-privileged user can substitute any executable for the nssm.exe service launcher, or CouchDB batch or binary files. A subsequent service or server restart will then run that binary with administrator privilege. This issue affected CouchDB 2.0.0 (Windows platform only) and was addressed in CouchDB 2.0.0.1.",
    "severity": "HIGH",
    "url": "http://mail-archives.apache.org/mod_mbox/couchdb-dev/201612.mbox/%3C825F65E1-0E5F-4E1F-8053-CF2C6200C526%40apache.org%3E"
  },
  {
    "cve": "CVE-2016-8750",
    "year": "2016",
    "description": "Apache Karaf prior to 4.0.8 used the LDAPLoginModule to authenticate users to a directory via LDAP. However, it did not encoding usernames properly and hence was vulnerable to LDAP injection attacks leading to a denial of service.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/103098"
  },
  {
    "cve": "CVE-2016-9038",
    "year": "2016",
    "description": "An exploitable double fetch vulnerability exists in the SboxDrv.sys driver functionality of Invincea-X 6.1.3-24058. A specially crafted input buffer and race condition can result in kernel memory corruption, which could result in privilege escalation. An attacker needs to execute a special application locally to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/99360"
  },
  {
    "cve": "CVE-2016-9040",
    "year": "2016",
    "description": "An exploitable denial of service exists in the the Joyent SmartOS OS 20161110T013148Z Hyprlofs file system. The vulnerability is present in the Ioctl system call with the command HYPRLOFSADDENTRIES when used with a 32 bit model. An attacker can cause a buffer to be allocated and never freed. When repeatedly exploit this will result in memory exhaustion, resulting in a full system denial of service.",
    "severity": "MEDIUM",
    "url": "https://www.talosintelligence.com/vulnerability_reports/TALOS-2016-0258"
  },
  {
    "cve": "CVE-2016-9042",
    "year": "2016",
    "description": "An exploitable denial of service vulnerability exists in the origin timestamp check functionality of ntpd 4.2.8p9. A specially crafted unauthenticated network packet can be used to reset the expected origin timestamp for target peers. Legitimate replies from targeted peers will fail the origin timestamp check (TEST2) causing the reply to be dropped and creating a denial of service condition.",
    "severity": "MEDIUM",
    "url": "http://packetstormsecurity.com/files/142101/FreeBSD-Security-Advisory-FreeBSD-SA-17-03.ntp.html"
  },
  {
    "cve": "CVE-2016-9044",
    "year": "2016",
    "description": "An exploitable command execution vulnerability exists in Information Builders WebFOCUS Business Intelligence Portal 8.1 . A specially crafted web parameter can cause a command injection. An authenticated attacker can send a crafted web request to trigger this vulnerability.",
    "severity": "HIGH",
    "url": "https://talosintelligence.com/vulnerability_reports/TALOS-2017-0315"
  },
  {
    "cve": "CVE-2016-9048",
    "year": "2016",
    "description": "Multiple exploitable SQL Injection vulnerabilities exists in ProcessMaker Enterprise Core 3.0.1.7-community. Specially crafted web requests can cause SQL injections. An attacker can send a web request with parameters containing SQL injection attacks to trigger this vulnerability, potentially allowing exfiltration of the database, user credentials and in certain setups access the underlying operating system.",
    "severity": "HIGH",
    "url": "https://talosintelligence.com/vulnerability_reports/TALOS-2017-0313"
  },
  {
    "cve": "CVE-2016-9066",
    "year": "2016",
    "description": "A buffer overflow resulting in a potentially exploitable crash due to memory allocation issues when handling large amounts of incoming data. This vulnerability affects Thunderbird < 45.5, Firefox ESR < 45.5, and Firefox < 50.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2780.html"
  },
  {
    "cve": "CVE-2016-9067",
    "year": "2016",
    "description": "Two use-after-free errors during DOM operations resulting in potentially exploitable crashes. This vulnerability affects Firefox < 50.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-9068",
    "year": "2016",
    "description": "A use-after-free during web animations when working with timelines resulting in a potentially exploitable crash. This vulnerability affects Firefox < 50.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-9069",
    "year": "2016",
    "description": "A use-after-free in nsINode::ReplaceOrInsertBefore during DOM operations resulting in potentially exploitable crashes. This vulnerability affects Firefox < 50.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-9072",
    "year": "2016",
    "description": "When a new Firefox profile is created on 64-bit Windows installations, the sandbox for 64-bit NPAPI plugins is not enabled by default. Note: This issue only affects 64-bit Windows. 32-bit Windows and other operating systems are unaffected. This vulnerability affects Firefox < 50.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-9076",
    "year": "2016",
    "description": "An issue where a \"<select>\" dropdown menu can be used to cover location bar content, resulting in potential spoofing attacks. This attack requires e10s to be enabled in order to function. This vulnerability affects Firefox < 50.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-9077",
    "year": "2016",
    "description": "Canvas allows the use of the \"feDisplacementMap\" filter on images loaded cross-origin. The rendering by the filter is variable depending on the input pixel, allowing for timing attacks when the images are loaded from third party locations. This vulnerability affects Firefox < 50.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94337"
  },
  {
    "cve": "CVE-2016-9093",
    "year": "2016",
    "description": "A version of the SymEvent Driver that shipped with Symantec Endpoint Protection 12.1 RU6 MP6 and earlier fails to properly sanitize logged-in user input. SEP 14.0 and later are not impacted by this issue. A non-admin user would need to be able to save an executable file to disk and then be able to successfully run that file. If properly constructed, the file could access the driver interface and potentially manipulate certain system calls. On all 32-bit systems and in most cases on 64-bit systems, this will result in a denial of service that will crash the system. In very narrow circumstances, and on 64-bit systems only, this could allow the user to run arbitrary code on the local machine with kernel-level privileges. This could result in a non-privileged user gaining privileged access on the local machine.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/96294"
  },
  {
    "cve": "CVE-2016-9094",
    "year": "2016",
    "description": "Symantec Endpoint Protection clients place detected malware in quarantine as part of the intended product functionality. The quarantine logs can be exported for review by the user in a variety of formats including .CSV files. Prior to 14.0 MP1 and 12.1 RU6 MP7, the potential exists for file metadata to be interpreted and evaluated as a formula. Successful exploitation of an attack of this type requires considerable direct user-interaction from the user exporting and then opening the log files on the intended target client.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/96298"
  },
  {
    "cve": "CVE-2016-9166",
    "year": "2016",
    "description": "NetIQ eDirectory versions prior to 9.0.2, under some circumstances, could be susceptible to downgrade of communication security.",
    "severity": "HIGH",
    "url": "https://www.netiq.com/documentation/edirectory-9/edirectory902_releasenotes/data/edirectory902_releasenotes.html"
  },
  {
    "cve": "CVE-2016-9335",
    "year": "2016",
    "description": "A hard-coded cryptographic key vulnerability was identified in Red Lion Controls Sixnet-Managed Industrial Switches running firmware Version 5.0.196 and Stride-Managed Ethernet Switches running firmware Version 5.0.190. Vulnerable versions of Stride-Managed Ethernet switches and Sixnet-Managed Industrial switches use hard-coded HTTP SSL/SSH keys for secure communication. Because these keys cannot be regenerated by users, all products use the same key. The attacker could disrupt communication or compromise the system. CVSS v3 base score: 10, CVSS vector string: (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). Red Lion Controls recommends updating to SLX firmware Version 5.3.174.",
    "severity": "CRITICAL",
    "url": "https://ics-cert.us-cert.gov/advisories/ICSA-17-054-02"
  },
  {
    "cve": "CVE-2016-9483",
    "year": "2016",
    "description": "The PHP form code generated by PHP FormMail Generator deserializes untrusted input as part of the phpfmg_filman_download() function. A remote unauthenticated attacker may be able to use this vulnerability to inject PHP code, or along with CVE-2016-9484 to perform local file inclusion attacks and obtain files from the server.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/94778"
  },
  {
    "cve": "CVE-2016-9484",
    "year": "2016",
    "description": "The generated PHP form code does not properly validate user input folder directories, allowing a remote unauthenticated attacker to perform a path traversal and access arbitrary files on the server. The PHP FormMail Generator website does not use version numbers and is updated continuously. Any PHP form code generated by this website prior to 2016-12-06 may be vulnerable.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94778"
  },
  {
    "cve": "CVE-2016-9485",
    "year": "2016",
    "description": "On Windows endpoints, the SecureConnector agent must run under the local SYSTEM account or another administrator account in order to enable full functionality of the agent. The typical configuration is for the agent to run as a Windows service under the local SYSTEM account. The SecureConnector agent runs various plugin scripts and executables on the endpoint in order to gather and report information about the host to the CounterACT management appliance. The SecureConnector agent downloads these scripts and executables as needed from the CounterACT management appliance and runs them on the endpoint. The SecureConnector agent fails to set any permissions on downloaded file objects. This allows a malicious user to take ownership of any of these files and make modifications to it, regardless of where the files are saved. These files are then executed under SYSTEM privileges. A malicious unprivileged user can overwrite these executable files with malicious code before the SecureConnector agent executes them, causing the malicious code to be run under the SYSTEM account.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94740"
  },
  {
    "cve": "CVE-2016-9486",
    "year": "2016",
    "description": "On Windows endpoints, the SecureConnector agent must run under the local SYSTEM account or another administrator account in order to enable full functionality of the agent. The typical configuration is for the agent to run as a Windows service under the local SYSTEM account. The SecureConnector agent runs various plugin scripts and executables on the endpoint in order to gather and report information about the host to the CounterACT management appliance. The SecureConnector agent downloads these scripts and executables as needed from the CounterACT management appliance and runs them on the endpoint. By default, these executable files are downloaded to and run from the %TEMP% directory of the currently logged on user, despite the fact that the SecureConnector agent is running as SYSTEM. Aside from the downloaded scripts, the SecureConnector agent runs a batch file with SYSTEM privileges from the temp directory of the currently logged on user. If the naming convention of this script can be derived, which is made possible by placing it in a directory to which the user has read access, it may be possible overwrite the legitimate batch file with a malicious one before SecureConnector executes it. It is possible to change this directory by setting the the configuration property config.script_run_folder.value in the local.properties configuration file on the CounterACT management appliance, however the batch file which is run does not follow this property.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94740"
  },
  {
    "cve": "CVE-2016-9487",
    "year": "2016",
    "description": "EpubCheck 4.0.1 does not properly restrict resolving external entities when parsing XML in EPUB files during validation. An attacker who supplies a specially crafted EPUB file may be able to exploit this behavior to read arbitrary files, or have the victim execute arbitrary requests on his behalf, abusing the victim's trust relationship with other entities.",
    "severity": "HIGH",
    "url": "https://www.kb.cert.org/vuls/id/779243"
  },
  {
    "cve": "CVE-2016-9488",
    "year": "2016",
    "description": "ManageEngine Applications Manager versions 12 and 13 before build 13200 suffer from remote SQL injection vulnerabilities. An unauthenticated attacker is able to access the URL /servlet/MenuHandlerServlet, which is vulnerable to SQL injection. The attacker could extract users' password hashes, which are MD5 hashes without salt, and, depending on the database type and its configuration, could also execute operating system commands using SQL queries.",
    "severity": "CRITICAL",
    "url": "http://packetstormsecurity.com/files/158554/ManageEngine-Applications-Manager-13-SQL-Injection.html"
  },
  {
    "cve": "CVE-2016-9489",
    "year": "2016",
    "description": "In ManageEngine Applications Manager 12 and 13 before build 13200, an authenticated user is able to alter all of their own properties, including own group, i.e. changing their group to one with higher privileges like \"ADMIN\". A user is also able to change properties of another user, e.g. change another user's password.",
    "severity": "HIGH",
    "url": "http://seclists.org/fulldisclosure/2017/Apr/9"
  },
  {
    "cve": "CVE-2016-9490",
    "year": "2016",
    "description": "ManageEngine Applications Manager versions 12 and 13 before build 13200 suffer from a Reflected Cross-Site Scripting vulnerability. Applications Manager is prone to a Cross-Site Scripting vulnerability in parameter LIMIT, in URL path /DiagAlertAction.do?REQTYPE=AJAX&LIMIT=1233. The URL is also available without authentication.",
    "severity": "MEDIUM",
    "url": "http://seclists.org/fulldisclosure/2017/Apr/9"
  },
  {
    "cve": "CVE-2016-9491",
    "year": "2016",
    "description": "ManageEngine Applications Manager 12 and 13 before build 13690 allows an authenticated user, who is able to access /register.do page (most likely limited to administrator), to browse the filesystem and read the system files, including Applications Manager configuration, stored private keys, etc. By default Application Manager is running with administrative privileges, therefore it is possible to access every directory on the underlying operating system.",
    "severity": "MEDIUM",
    "url": "http://seclists.org/fulldisclosure/2017/Apr/9"
  },
  {
    "cve": "CVE-2016-9492",
    "year": "2016",
    "description": "The code generated by PHP FormMail Generator prior to 17 December 2016 is vulnerable to unrestricted upload of dangerous file types. In the generated form.lib.php file, upload file types are checked against a hard-coded list of dangerous extensions. This list does not include all variations of PHP files, which may lead to execution of the contained PHP code if the attacker can guess the uploaded filename. The form by default appends a short random string to the end of the filename.",
    "severity": "CRITICAL",
    "url": "http://www.securityfocus.com/bid/96718"
  },
  {
    "cve": "CVE-2016-9493",
    "year": "2016",
    "description": "The code generated by PHP FormMail Generator prior to 17 December 2016 is vulnerable to stored cross-site scripting. In the generated form.lib.php file, upload file types are checked against a hard-coded list of dangerous extensions. This list does not include all variations of PHP files, which may lead to execution of the contained PHP code if the attacker can guess the uploaded filename. The form by default appends a short random string to the end of the filename.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/96718"
  },
  {
    "cve": "CVE-2016-9494",
    "year": "2016",
    "description": "Hughes high-performance broadband satellite modems, models HN7740S DW7000 HN7000S/SM, are potentially vulnerable to improper input validation. The device's advanced status web page that is linked to from the basic status web page does not appear to properly parse malformed GET requests. This may lead to a denial of service.",
    "severity": "MEDIUM",
    "url": "https://www.kb.cert.org/vuls/id/614751"
  },
  {
    "cve": "CVE-2016-9497",
    "year": "2016",
    "description": "Hughes high-performance broadband satellite modems, models HN7740S DW7000 HN7000S/SM, is vulnerable to an authentication bypass using an alternate path or channel. By default, port 1953 is accessible via telnet and does not require authentication. An unauthenticated remote user can access many administrative commands via this interface, including rebooting the modem.",
    "severity": "HIGH",
    "url": "https://www.kb.cert.org/vuls/id/614751"
  },
  {
    "cve": "CVE-2016-9500",
    "year": "2016",
    "description": "Accellion FTP server prior to version FTA_9_12_220 uses the Accusoft Prizm Content flash component, which contains multiple parameters (customTabCategoryName, customButton1Image) that are vulnerable to cross-site scripting.",
    "severity": "MEDIUM",
    "url": "https://www.kb.cert.org/vuls/id/745607"
  },
  {
    "cve": "CVE-2016-9572",
    "year": "2016",
    "description": "A NULL pointer dereference flaw was found in the way openjpeg 2.1.2 decoded certain input images. Due to a logic error in the code responsible for decoding the input image, an application using openjpeg to process image data could crash when processing a crafted image.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/109233"
  },
  {
    "cve": "CVE-2016-9574",
    "year": "2016",
    "description": "nss before version 3.30 is vulnerable to a remote denial of service during the session handshake when using SessionTicket extension and ECDHE-ECDSA.",
    "severity": "MEDIUM",
    "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1320695"
  },
  {
    "cve": "CVE-2016-9577",
    "year": "2016",
    "description": "A vulnerability was discovered in SPICE before 0.13.90 in the server's protocol handling. An authenticated attacker could send crafted messages to the SPICE server causing a heap overflow leading to a crash or possible code execution.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0253.html"
  },
  {
    "cve": "CVE-2016-9578",
    "year": "2016",
    "description": "A vulnerability was discovered in SPICE before 0.13.90 in the server's protocol handling. An attacker able to connect to the SPICE server could send crafted messages which would cause the process to crash.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0253.html"
  },
  {
    "cve": "CVE-2016-9585",
    "year": "2016",
    "description": "Red Hat JBoss EAP version 5 is vulnerable to a deserialization of untrusted data in the JMX endpoint when deserializes the credentials passed to it. An attacker could exploit this vulnerability resulting in a denial of service attack.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94932"
  },
  {
    "cve": "CVE-2016-9586",
    "year": "2016",
    "description": "curl before version 7.52.0 is vulnerable to a buffer overflow when doing a large floating point output in libcurl's implementation of the printf() functions. If there are any application that accepts a format string from the outside without necessary input filtering, it could allow remote attacks.",
    "severity": "HIGH",
    "url": "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html"
  },
  {
    "cve": "CVE-2016-9587",
    "year": "2016",
    "description": "Ansible before versions 2.1.4, 2.2.1 is vulnerable to an improper input validation in Ansible's handling of data sent from client systems. An attacker with control over a client system being managed by Ansible and the ability to send facts back to the Ansible server could use this flaw to execute arbitrary code on the Ansible server using the Ansible server privileges.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0195.html"
  },
  {
    "cve": "CVE-2016-9589",
    "year": "2016",
    "description": "Undertow in Red Hat wildfly before version 11.0.0.Beta1 is vulnerable to a resource exhaustion resulting in a denial of service. Undertow keeps a cache of seen HTTP headers in persistent connections. It was found that this cache can easily exploited to fill memory with garbage, up to \"max-headers\" (default 200) * \"max-header-size\" (default 1MB) per active TCP connection.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0830.html"
  },
  {
    "cve": "CVE-2016-9590",
    "year": "2016",
    "description": "puppet-swift before versions 8.2.1, 9.4.4 is vulnerable to an information-disclosure in Red Hat OpenStack Platform director's installation of Object Storage (swift). During installation, the Puppet script responsible for deploying the service incorrectly removes and recreates the proxy-server.conf file with world-readable permissions.",
    "severity": "MEDIUM",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0200.html"
  },
  {
    "cve": "CVE-2016-9591",
    "year": "2016",
    "description": "JasPer before version 2.0.12 is vulnerable to a use-after-free in the way it decodes certain JPEG 2000 image files resulting in a crash on the application using JasPer.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94952"
  },
  {
    "cve": "CVE-2016-9592",
    "year": "2016",
    "description": "openshift before versions 3.3.1.11, 3.2.1.23, 3.4 is vulnerable to a flaw when a volume fails to detach, which causes the delete operation to fail with 'VolumeInUse' error. Since the delete operation is retried every 30 seconds for each volume, this could lead to a denial of service attack as the number of API requests being sent to the cloud-provider exceeds the API's rate-limit.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94991"
  },
  {
    "cve": "CVE-2016-9593",
    "year": "2016",
    "description": "foreman-debug before version 1.15.0 is vulnerable to a flaw in foreman-debug's logging. An attacker with access to the foreman log file would be able to view passwords, allowing them to access those systems.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94985"
  },
  {
    "cve": "CVE-2016-9594",
    "year": "2016",
    "description": "curl before version 7.52.1 is vulnerable to an uninitialized random in libcurl's internal function that returns a good 32bit random value.  Having a weak or virtually non-existent random value makes the operations that use it vulnerable.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/95094"
  },
  {
    "cve": "CVE-2016-9597",
    "year": "2016",
    "description": "It was found that Red Hat JBoss Core Services erratum RHSA-2016:2957 for CVE-2016-3705 did not actually include the fix for the issue found in libxml2, making it vulnerable to a Denial of Service attack due to a Stack Overflow. This is a regression CVE for the same issue as CVE-2016-3705.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/98567"
  },
  {
    "cve": "CVE-2016-9599",
    "year": "2016",
    "description": "puppet-tripleo before versions 5.5.0, 6.2.0 is vulnerable to an access-control flaw in the IPtables rules management, which allowed the creation of TCP/UDP rules with empty port values. If SSL is enabled, a malicious user could use these open ports to gain access to unauthorized resources.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2017-0025.html"
  },
  {
    "cve": "CVE-2016-9600",
    "year": "2016",
    "description": "JasPer before version 2.0.10 is vulnerable to a null pointer dereference was found in the decoded creation of JPEG 2000 image files. A specially crafted file could cause an application using JasPer to crash.",
    "severity": "MEDIUM",
    "url": "https://access.redhat.com/errata/RHSA-2017:1208"
  },
  {
    "cve": "CVE-2016-9601",
    "year": "2016",
    "description": "ghostscript before version 9.21 is vulnerable to a heap based buffer overflow that was found in the ghostscript jbig2_decode_gray_scale_image function which is used to decode halftone segments in a JBIG2 image. A document (PostScript or PDF) with an embedded, specially crafted, jbig2 image could trigger a segmentation fault in ghostscript.",
    "severity": "MEDIUM",
    "url": "http://git.ghostscript.com/?p=jbig2dec.git%3Ba=commit%3Bh=e698d5c11d27212aa1098bc5b1673a3378563092"
  },
  {
    "cve": "CVE-2016-9602",
    "year": "2016",
    "description": "Qemu before version 2.9 is vulnerable to an improper link following when built with the VirtFS. A privileged user inside guest could use this flaw to access host file system beyond the shared folder and potentially escalating their privileges on a host.",
    "severity": "HIGH",
    "url": "http://www.openwall.com/lists/oss-security/2017/01/17/12"
  },
  {
    "cve": "CVE-2016-9605",
    "year": "2016",
    "description": "A flaw was found in cobbler software component version 2.6.11-1. It suffers from an invalid parameter validation vulnerability, leading the arbitrary file reading. The flaw is triggered by navigating to a vulnerable URL via cobbler-web on a default installation.",
    "severity": "MEDIUM",
    "url": "https://bugzilla.redhat.com/show_bug.cgi?id=CVE-2016-9605"
  },
  {
    "cve": "CVE-2016-9778",
    "year": "2016",
    "description": "An error in handling certain queries can cause an assertion failure when a server is using the nxdomain-redirect feature to cover a zone for which it is also providing authoritative service. A vulnerable server could be intentionally stopped by an attacker if it was using a configuration that met the criteria for the vulnerability and if the attacker could cause it to accept a query that possessed the required attributes. Please note: This vulnerability affects the \"nxdomain-redirect\" feature, which is one of two methods of handling NXDOMAIN redirection, and is only available in certain versions of BIND. Redirection using zones of type \"redirect\" is not affected by this vulnerability. Affects BIND 9.9.8-S1 -> 9.9.8-S3, 9.9.9-S1 -> 9.9.9-S6, 9.11.0-9.11.0-P1.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/95388"
  },
  {
    "cve": "CVE-2016-9894",
    "year": "2016",
    "description": "A buffer overflow in SkiaGl caused when a GrGLBuffer is truncated during allocation. Later writers will overflow the buffer, resulting in a potentially exploitable crash. This vulnerability affects Firefox < 50.1.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94883"
  },
  {
    "cve": "CVE-2016-9896",
    "year": "2016",
    "description": "Use-after-free while manipulating the \"navigator\" object within WebVR. Note: WebVR is not currently enabled by default. This vulnerability affects Firefox < 50.1.",
    "severity": "HIGH",
    "url": "http://www.securityfocus.com/bid/94883"
  },
  {
    "cve": "CVE-2016-9897",
    "year": "2016",
    "description": "Memory corruption resulting in a potentially exploitable crash during WebGL functions using a vector constructor with a varying array within libGLES. This vulnerability affects Firefox < 50.1, Firefox ESR < 45.6, and Thunderbird < 45.6.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2946.html"
  },
  {
    "cve": "CVE-2016-9898",
    "year": "2016",
    "description": "Use-after-free resulting in potentially exploitable crash when manipulating DOM subtrees in the Editor. This vulnerability affects Firefox < 50.1, Firefox ESR < 45.6, and Thunderbird < 45.6.",
    "severity": "CRITICAL",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2946.html"
  },
  {
    "cve": "CVE-2016-9902",
    "year": "2016",
    "description": "The Pocket toolbar button, once activated, listens for events fired from it's own pages but does not verify the origin of incoming events. This allows content from other origins to fire events and inject content and commands into the Pocket context. Note: this issue does not affect users with e10s enabled. This vulnerability affects Firefox ESR < 45.6 and Firefox < 50.1.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2946.html"
  },
  {
    "cve": "CVE-2016-9903",
    "year": "2016",
    "description": "Mozilla's add-ons SDK had a world-accessible resource with an HTML injection vulnerability. If an additional vulnerability allowed this resource to be loaded as a document it could allow injecting content and script into an add-on's context. This vulnerability affects Firefox < 50.1.",
    "severity": "MEDIUM",
    "url": "http://www.securityfocus.com/bid/94883"
  },
  {
    "cve": "CVE-2016-9905",
    "year": "2016",
    "description": "A potentially exploitable crash in \"EnumerateSubDocuments\" while adding or removing sub-documents. This vulnerability affects Firefox ESR < 45.6 and Thunderbird < 45.6.",
    "severity": "HIGH",
    "url": "http://rhn.redhat.com/errata/RHSA-2016-2946.html"
  },
  {
    "cve": "CVE-2016-9928",
    "year": "2016",
    "description": "MCabber before 1.0.4 is vulnerable to roster push attacks, which allows remote attackers to intercept communications, or add themselves as an entity on a 3rd party's roster as another user, which will also garner associated privileges, via crafted XMPP packets.",
    "severity": "HIGH",
    "url": "http://lists.opensuse.org/opensuse-updates/2017-01/msg00130.html"
  },
  {
    "cve": "CVE-2016-9969",
    "year": "2016",
    "description": "In libwebp 0.5.1, there is a double free bug in libwebpmux.",
    "severity": "HIGH",
    "url": "https://bugs.chromium.org/p/webp/issues/detail?id=322"
  }
]